/*
SQLyog v10.2 
MySQL - 5.5.8-log : Database - framework
*********************************************************************
*/

/*!40101 SET NAMES utf8 */;

/*!40101 SET SQL_MODE=''*/;

/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;
CREATE DATABASE /*!32312 IF NOT EXISTS*/`framework` /*!40100 DEFAULT CHARACTER SET utf8 */;

USE `framework`;

/*Table structure for table `bs_leave_bill` */

DROP TABLE IF EXISTS `bs_leave_bill`;

CREATE TABLE `bs_leave_bill` (
  `id` int(11) NOT NULL AUTO_INCREMENT COMMENT 'PK',
  `userId` int(11) NOT NULL DEFAULT '0' COMMENT '请假人FK',
  `billType` int(11) NOT NULL DEFAULT '0' COMMENT '请假类型',
  `days` int(11) NOT NULL DEFAULT '0' COMMENT '请假天数',
  `beginDate` timestamp NOT NULL DEFAULT '0000-00-00 00:00:00' COMMENT '开始时间',
  `endDate` timestamp NOT NULL DEFAULT '0000-00-00 00:00:00' COMMENT '结束时间',
  `remark` text NOT NULL COMMENT '备注',
  `addTime` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP COMMENT '添加时间',
  `updateTime` timestamp NOT NULL DEFAULT '0000-00-00 00:00:00' COMMENT '修改时间',
  `delFlag` tinyint(4) NOT NULL DEFAULT '0' COMMENT '标识位，0：初始录入，1：审批中， 2：审批完成',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=2 DEFAULT CHARSET=utf8 COMMENT='请假单';

/*Data for the table `bs_leave_bill` */

insert  into `bs_leave_bill`(`id`,`userId`,`billType`,`days`,`beginDate`,`endDate`,`remark`,`addTime`,`updateTime`,`delFlag`) values (1,2,3,2,'2017-08-15 18:34:00','2017-08-23 18:34:00','身体不舒服','2017-08-14 18:34:20','0000-00-00 00:00:00',0);

/*Table structure for table `cm_base_data` */

DROP TABLE IF EXISTS `cm_base_data`;

CREATE TABLE `cm_base_data` (
  `id` int(11) NOT NULL AUTO_INCREMENT COMMENT 'PK',
  `key` varchar(20) NOT NULL DEFAULT '' COMMENT 'Key',
  `value` varchar(200) NOT NULL DEFAULT '' COMMENT 'Value',
  `seq` int(4) NOT NULL DEFAULT '0' COMMENT '顺序',
  `url` varchar(100) NOT NULL DEFAULT '' COMMENT '图片地址',
  `addPerson` varchar(20) NOT NULL DEFAULT '' COMMENT '添加人',
  `addTime` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP COMMENT '添加时间',
  `updatePerson` varchar(20) NOT NULL DEFAULT '' COMMENT '修改人',
  `updateTime` timestamp NOT NULL DEFAULT '0000-00-00 00:00:00' COMMENT '修改时间',
  `delFlag` tinyint(4) NOT NULL DEFAULT '0' COMMENT '删除标识位，0：未删除，1：已删除',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=9 DEFAULT CHARSET=utf8 COMMENT='基础数据配置表';

/*Data for the table `cm_base_data` */

insert  into `cm_base_data`(`id`,`key`,`value`,`seq`,`url`,`addPerson`,`addTime`,`updatePerson`,`updateTime`,`delFlag`) values (3,'leave_type','事假',0,'2017/8/14/18/73a6b4eb-cc3b-4a92-bbe1-c12ce98dc8f3.jpg','管理员','2017-08-14 18:29:32','','2017-08-14 18:29:50',0),(4,'leave_type','病假',0,'','管理员','2017-08-14 18:35:46','','0000-00-00 00:00:00',0),(5,'file_type','{\"id\":\"5\",\"name\":\"音乐\",\"url\":\"common/resource/index/5\"}',0,'2017/8/14/18/6aeda7f5-f224-417b-a485-9f254e05b80b.jpg','管理员','2017-08-14 18:46:50','','2017-08-14 20:14:13',0),(6,'file_type','{\"id\":\"6\",\"name\":\"电影\",\"url\":\"common/resource/index/6\"}',0,'2017/8/14/18/ad6b50b7-28ea-45ac-bb2b-4e3f21ed82a5.jpg','管理员','2017-08-14 18:46:56','','2017-08-14 20:13:50',0),(7,'file_type','{\"id\":\"7\",\"name\":\"软件\",\"url\":\"common/resource/index/7\"}',0,'2017/8/14/18/1e0a91c8-4eb4-4ae4-9552-b278f17a47f1.jpg','管理员','2017-08-14 18:47:02','','2017-08-14 20:13:36',0),(8,'file_type','{\"id\":\"0\",\"name\":\"资源管理\",\"url\":\"common/resource/index\"}',0,'','管理员','2017-08-14 20:55:09','','2017-08-14 20:57:29',1);

/*Table structure for table `cm_festival` */

DROP TABLE IF EXISTS `cm_festival`;

CREATE TABLE `cm_festival` (
  `id` int(11) NOT NULL AUTO_INCREMENT COMMENT 'PK',
  `name` varchar(20) NOT NULL DEFAULT '' COMMENT '节日名称',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COMMENT='节日表';

/*Data for the table `cm_festival` */

/*Table structure for table `cm_festival_date` */

DROP TABLE IF EXISTS `cm_festival_date`;

CREATE TABLE `cm_festival_date` (
  `id` int(11) NOT NULL AUTO_INCREMENT COMMENT 'PK',
  `fId` int(11) NOT NULL DEFAULT '0' COMMENT '节日id',
  `year` int(4) NOT NULL DEFAULT '0' COMMENT '年份',
  `fRestDate` varchar(100) NOT NULL DEFAULT '' COMMENT '放假日期',
  `fWorkDate` varchar(100) NOT NULL DEFAULT '' COMMENT '补工日期',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COMMENT='法定假日及补工日安排表';

/*Data for the table `cm_festival_date` */

/*Table structure for table `cm_oper_log` */

DROP TABLE IF EXISTS `cm_oper_log`;

CREATE TABLE `cm_oper_log` (
  `id` int(11) NOT NULL AUTO_INCREMENT COMMENT 'PK',
  `clientIP` varchar(20) NOT NULL DEFAULT '' COMMENT '客户端IP',
  `operatorId` int(11) NOT NULL DEFAULT '0' COMMENT '操作人ID',
  `operatorName` varchar(30) NOT NULL DEFAULT '' COMMENT '操作人姓名',
  `resName` varchar(100) NOT NULL DEFAULT '' COMMENT '资源名称',
  `requestUri` varchar(100) NOT NULL DEFAULT '' COMMENT '访问地址',
  `requestArgs` text NOT NULL COMMENT '访问参数',
  `addTime` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP COMMENT '添加时间',
  `delFlag` tinyint(4) NOT NULL DEFAULT '0' COMMENT '删除标识位，0：未删除，1：已删除',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=442 DEFAULT CHARSET=utf8 COMMENT='操作日志表';

/*Data for the table `cm_oper_log` */

insert  into `cm_oper_log`(`id`,`clientIP`,`operatorId`,`operatorName`,`resName`,`requestUri`,`requestArgs`,`addTime`,`delFlag`) values (1,'127.0.0.1',0,'','','common/main/login','{}','2017-08-14 18:05:24',0),(2,'127.0.0.1',2,'管理员','','common/main/index','{}','2017-08-14 18:05:44',0),(3,'127.0.0.1',2,'管理员','资源管理','common/resource/index','{}','2017-08-14 18:05:53',0),(4,'127.0.0.1',2,'管理员','角色管理','common/role/index','{}','2017-08-14 18:05:55',0),(5,'127.0.0.1',2,'管理员','','common/role/1/authConfig','{}','2017-08-14 18:05:58',0),(6,'127.0.0.1',2,'管理员','','common/main/index','{}','2017-08-14 18:07:40',0),(7,'127.0.0.1',2,'管理员','','common/main/index','{}','2017-08-14 18:12:33',0),(8,'127.0.0.1',2,'管理员','流程管理','proc/index','{}','2017-08-14 18:12:42',0),(9,'127.0.0.1',2,'管理员','日志查询','common/main/operLogList','{}','2017-08-14 18:12:54',0),(10,'127.0.0.1',2,'管理员','日志监控','common/main/startLog','{}','2017-08-14 18:12:56',0),(11,'127.0.0.1',2,'管理员','','ws','{\"uid\":[\"2\"]}','2017-08-14 18:12:57',0),(12,'127.0.0.1',2,'管理员','用户管理','common/user/index','{}','2017-08-14 18:13:01',0),(13,'127.0.0.1',2,'管理员','角色管理','common/role/index','{}','2017-08-14 18:13:05',0),(14,'127.0.0.1',2,'管理员','','common/role/1/authConfig','{}','2017-08-14 18:13:07',0),(15,'127.0.0.1',2,'管理员','资源查看','common/resource/index','{}','2017-08-14 18:13:09',0),(16,'127.0.0.1',2,'管理员','','common/resource/64/toUpdateChild/0,60,64','{}','2017-08-14 18:13:36',0),(17,'127.0.0.1',2,'管理员','日志监控','common/main/startLog','{\"flag\":[\"0\"]}','2017-08-14 18:13:58',0),(18,'127.0.0.1',2,'管理员','','common/main/index','{}','2017-08-14 18:16:28',0),(19,'127.0.0.1',2,'管理员','资源查看','common/resource/index','{}','2017-08-14 18:16:30',0),(20,'127.0.0.1',2,'管理员','角色管理','common/role/index','{}','2017-08-14 18:16:32',0),(21,'127.0.0.1',2,'管理员','用户管理','common/user/index','{}','2017-08-14 18:16:34',0),(22,'127.0.0.1',2,'管理员','流程管理','proc/index','{}','2017-08-14 18:16:54',0),(23,'127.0.0.1',2,'管理员','日志监控','common/main/startLog','{}','2017-08-14 18:25:58',0),(24,'127.0.0.1',2,'管理员','','ws','{\"uid\":[\"2\"]}','2017-08-14 18:25:59',0),(25,'127.0.0.1',2,'管理员','日志监控','common/main/startLog','{\"flag\":[\"0\"]}','2017-08-14 18:26:02',0),(26,'127.0.0.1',2,'管理员','','common/main/index','{}','2017-08-14 18:28:28',0),(27,'127.0.0.1',2,'管理员','基础数据','common/baseData/index','{}','2017-08-14 18:28:31',0),(28,'127.0.0.1',2,'管理员','基础数据','common/baseData/index','{\"tokenKey\":[\"43faade8-0ae6-4d92-8f52-7ef9bbaf6931\"],\"tokenValue\":[\"e299c0a0-6ed9-4cd4-8fbd-ae61047029a9\"],\"key\":[\"\"],\"delFlag\":[\"0\"],\"pageSize\":[\"20\"],\"pageNo\":[\"1\"]}','2017-08-14 18:28:36',0),(29,'127.0.0.1',2,'管理员','基础数据','common/baseData/index','{\"tokenKey\":[\"f7efe2a3-7a4d-4fe0-ac31-5fc39fc45db1\"],\"tokenValue\":[\"a570a673-9a8a-46f2-a591-418775c67202\"],\"key\":[\"\"],\"delFlag\":[\"1\"],\"pageSize\":[\"20\"],\"pageNo\":[\"1\"]}','2017-08-14 18:28:37',0),(30,'127.0.0.1',2,'管理员','基础数据','common/baseData/index','{\"tokenKey\":[\"6ac1ddb1-3610-4cb7-99c6-8e0af28beb14\"],\"tokenValue\":[\"6a5c9994-51f3-4645-a4d3-651936453df3\"],\"key\":[\"\"],\"delFlag\":[\"-1\"],\"pageSize\":[\"20\"],\"pageNo\":[\"1\"]}','2017-08-14 18:28:39',0),(31,'127.0.0.1',2,'管理员','','common/baseData/add','{}','2017-08-14 18:28:44',0),(32,'127.0.0.1',2,'管理员','','common/baseData/add','{\"id\":[\"\"],\"tokenKey\":[\"9517ba00-547b-4400-80d3-1ccbee301b20\"],\"seq\":[\"\"],\"value\":[\"事假\"],\"tokenValue\":[\"6158e247-1048-4d7a-87b5-04dddd36de6a\"],\"key\":[\"leave_type\"],\"url\":[\"\"]}','2017-08-14 18:29:32',0),(33,'127.0.0.1',2,'管理员','基础数据','common/baseData/index','{\"tokenKey\":[\"8d348b9d-a340-4cfe-a7e8-3c1a42d74a06\"],\"tokenValue\":[\"ee51db99-9dbe-42a9-b815-5db5ae4222cd\"],\"key\":[\"\"],\"delFlag\":[\"-1\"],\"pageSize\":[\"20\"],\"pageNo\":[\"1\"]}','2017-08-14 18:29:32',0),(34,'127.0.0.1',2,'管理员','','common/baseData/3/update','{}','2017-08-14 18:29:41',0),(35,'127.0.0.1',2,'管理员','','common/baseData/3/chgFlag/1','{}','2017-08-14 18:29:45',0),(36,'127.0.0.1',2,'管理员','基础数据','common/baseData/index','{\"tokenKey\":[\"3278a17e-df38-4d3a-acd6-7661546682b2\"],\"tokenValue\":[\"d51aff31-597b-4e8a-a608-3f0fa1b5b874\"],\"key\":[\"\"],\"delFlag\":[\"-1\"],\"pageSize\":[\"20\"],\"pageNo\":[\"1\"]}','2017-08-14 18:29:46',0),(37,'127.0.0.1',2,'管理员','','common/baseData/3/chgFlag/0','{}','2017-08-14 18:29:50',0),(38,'127.0.0.1',2,'管理员','基础数据','common/baseData/index','{\"tokenKey\":[\"060133f3-8240-4235-b525-45b5021f21bd\"],\"tokenValue\":[\"c3067567-bd38-488e-9efc-ec212c898ee0\"],\"key\":[\"\"],\"delFlag\":[\"-1\"],\"pageSize\":[\"20\"],\"pageNo\":[\"1\"]}','2017-08-14 18:29:50',0),(39,'127.0.0.1',2,'管理员','资源查看','common/resource/index','{}','2017-08-14 18:30:07',0),(40,'127.0.0.1',2,'管理员','','common/resource/64/toUpdateChild/0,60,64','{}','2017-08-14 18:30:12',0),(41,'127.0.0.1',2,'管理员','','common/resource/64/toUpdateChild/0,60,64','{}','2017-08-14 18:32:29',0),(42,'127.0.0.1',2,'管理员','','common/resource/64/toUpdateChild/0,60,64','{}','2017-08-14 18:32:59',0),(43,'127.0.0.1',2,'管理员','资源修改','common/resource/updateChild','{\"tokenKey\":[\"4c9943d0-c7bf-4f17-99de-d14fb00c6212\"],\"tokenValue\":[\"12a5d5a4-8b39-4543-a240-312704cdeb56\"],\"id\":[\"64\"],\"pid\":[\"60\"],\"pids\":[\"0,60,64\"],\"name\":[\"我的业务\"],\"selpid\":[\"业务办理\"],\"type\":[\"menu\"],\"url\":[\"leaveBill/64\"],\"percode\":[\"\"],\"sortstring\":[\"0\"],\"available\":[\"1\"]}','2017-08-14 18:33:07',0),(44,'127.0.0.1',2,'管理员','资源查看','common/resource/index','{}','2017-08-14 18:33:07',0),(45,'127.0.0.1',2,'管理员','','common/resource/65/toUpdateChild/0,61,65','{}','2017-08-14 18:33:15',0),(46,'127.0.0.1',2,'管理员','','common/resource/66/toUpdateChild/0,61,66','{}','2017-08-14 18:33:20',0),(47,'127.0.0.1',2,'管理员','','common/resource/61/toUpdateChild/0,61','{}','2017-08-14 18:33:25',0),(48,'127.0.0.1',2,'管理员','','common/resource/64/toUpdateChild/0,60,64','{}','2017-08-14 18:33:34',0),(49,'127.0.0.1',2,'管理员','资源修改','common/resource/updateChild','{\"tokenKey\":[\"0c385ca6-bbeb-4f06-b30f-39ca12548557\"],\"tokenValue\":[\"ca0dbe9f-34d6-4c97-ad36-1580430bcd11\"],\"id\":[\"64\"],\"pid\":[\"60\"],\"pids\":[\"0,60,64\"],\"name\":[\"我的业务\"],\"selpid\":[\"业务办理\"],\"type\":[\"menu\"],\"url\":[\"leaveBill/index/64\"],\"percode\":[\"\"],\"sortstring\":[\"0\"],\"available\":[\"1\"]}','2017-08-14 18:33:46',0),(50,'127.0.0.1',2,'管理员','资源查看','common/resource/index','{}','2017-08-14 18:33:46',0),(51,'127.0.0.1',2,'管理员','','common/main/index','{}','2017-08-14 18:33:50',0),(52,'127.0.0.1',2,'管理员','我的业务','leaveBill/index/64','{}','2017-08-14 18:33:53',0),(53,'127.0.0.1',2,'管理员','','leaveBill/add/64','{}','2017-08-14 18:33:55',0),(54,'127.0.0.1',2,'管理员','','leaveBill/add','{\"tokenKey\":[\"b1dad370-e357-4540-825f-2a6012b2baf7\"],\"tokenValue\":[\"c446723c-5745-41d5-adaa-f1b432a246d3\"],\"id\":[\"\"],\"userId\":[\"\"],\"billType\":[\"3\"],\"days\":[\"2\"],\"beginDate\":[\"2017-08-15 18:34\"],\"endDate\":[\"2017-08-23 18:34\"],\"remark\":[\"身体不舒服\"]}','2017-08-14 18:34:20',0),(55,'127.0.0.1',2,'管理员','我的业务','leaveBill/index/64','{}','2017-08-14 18:34:20',0),(56,'127.0.0.1',2,'管理员','','common/main/login','{}','2017-08-14 18:34:29',0),(57,'127.0.0.1',2,'管理员','','common/main/login','{\"username\":[\"admin\"],\"password\":[\"123456\"],\"randomcode\":[\"343e\"]}','2017-08-14 18:34:32',0),(58,'127.0.0.1',2,'管理员','','common/main/login','{\"username\":[\"admin\"],\"password\":[\"123456\"],\"randomcode\":[\"1b08\"]}','2017-08-14 18:34:38',0),(59,'127.0.0.1',2,'管理员','','common/main/login','{\"username\":[\"admin\"],\"password\":[\"123456\"],\"randomcode\":[\"1b08\"]}','2017-08-14 18:34:43',0),(60,'127.0.0.1',2,'管理员','','common/main/login','{\"username\":[\"admin\"],\"password\":[\"123456\"],\"randomcode\":[\"76e4\"]}','2017-08-14 18:34:48',0),(61,'127.0.0.1',2,'管理员','','common/main/index;JSESSIONID=a979fc2c-487a-4acd-b28b-27d779a73b81','{}','2017-08-14 18:35:04',0),(62,'127.0.0.1',2,'管理员','流程管理','proc/index','{}','2017-08-14 18:35:07',0),(63,'127.0.0.1',2,'管理员','我的业务','leaveBill/index/64','{}','2017-08-14 18:35:10',0),(64,'127.0.0.1',2,'管理员','','leaveBill/1/update/64','{}','2017-08-14 18:35:30',0),(65,'127.0.0.1',2,'管理员','基础数据','common/baseData/index','{}','2017-08-14 18:35:35',0),(66,'127.0.0.1',2,'管理员','','common/baseData/add','{}','2017-08-14 18:35:38',0),(67,'127.0.0.1',2,'管理员','','common/baseData/add','{\"id\":[\"\"],\"tokenKey\":[\"f42956e4-5458-426d-89bf-3e7c69920ffe\"],\"seq\":[\"\"],\"value\":[\"病假\"],\"tokenValue\":[\"c6152358-43c3-47d6-950f-97059d83be95\"],\"key\":[\"leave_type\"],\"url\":[\"\"]}','2017-08-14 18:35:46',0),(68,'127.0.0.1',2,'管理员','基础数据','common/baseData/index','{\"tokenKey\":[\"62f9be6e-efed-4520-9e92-2dfda33a88f3\"],\"tokenValue\":[\"965b305d-65dc-412c-a92d-3ffd35017d4d\"],\"key\":[\"\"],\"delFlag\":[\"-1\"],\"pageSize\":[\"20\"],\"pageNo\":[\"1\"]}','2017-08-14 18:35:46',0),(69,'127.0.0.1',2,'管理员','','leaveBill/add/64','{}','2017-08-14 18:35:50',0),(70,'127.0.0.1',2,'管理员','','common/main/index;JSESSIONID=a979fc2c-487a-4acd-b28b-27d779a73b81','{}','2017-08-14 18:37:01',0),(71,'127.0.0.1',2,'管理员','我的业务','leaveBill/index/64','{}','2017-08-14 18:37:05',0),(72,'127.0.0.1',2,'管理员','资源查看','common/resource/index','{}','2017-08-14 18:38:14',0),(73,'127.0.0.1',2,'管理员','','common/resource/61/toUpdateChild/0,61','{}','2017-08-14 18:38:25',0),(74,'127.0.0.1',2,'管理员','','common/resource/0/toAddChild/0','{}','2017-08-14 18:38:28',0),(75,'127.0.0.1',2,'管理员','资源新增','common/resource/addChild','{\"tokenKey\":[\"cde84182-fea0-4f48-b46d-f576e2186412\"],\"tokenValue\":[\"86ae8923-c3ed-4c2f-83c0-b1c8e30f0026\"],\"id\":[\"\"],\"pid\":[\"0\"],\"pids\":[\"0\"],\"name\":[\"api接口示例\"],\"selpid\":[\"root\"],\"type\":[\"menu\"],\"url\":[\"app/user/testObj\"],\"percode\":[\"\"],\"sortstring\":[\"4\"],\"available\":[\"1\"]}','2017-08-14 18:41:21',0),(76,'127.0.0.1',2,'管理员','资源查看','common/resource/index','{}','2017-08-14 18:41:21',0),(77,'127.0.0.1',2,'管理员','','common/main/index;JSESSIONID=a979fc2c-487a-4acd-b28b-27d779a73b81','{}','2017-08-14 18:41:24',0),(78,'127.0.0.1',0,'','','common/main/login','{}','2017-08-14 18:41:27',0),(79,'127.0.0.1',2,'管理员','','common/main/index','{}','2017-08-14 18:41:30',0),(80,'127.0.0.1',2,'管理员','用户管理','common/user/index','{}','2017-08-14 18:41:35',0),(81,'127.0.0.1',2,'管理员','角色管理','common/role/index','{}','2017-08-14 18:41:38',0),(82,'127.0.0.1',2,'管理员','','common/role/1/authConfig','{}','2017-08-14 18:41:40',0),(83,'127.0.0.1',2,'管理员','','common/role/1/saveAuth','{\"resIds\":[\"1\",\"11\",\"13\",\"14\",\"27\",\"12\",\"21\",\"22\",\"23\",\"24\",\"26\",\"28\",\"29\",\"30\",\"31\",\"32\",\"33\",\"34\",\"35\",\"36\",\"37\",\"48\",\"49\",\"50\",\"51\",\"52\",\"53\",\"46\",\"47\",\"55\",\"54\",\"57\",\"58\",\"56\",\"59\",\"39\",\"45\",\"41\",\"42\",\"43\",\"44\",\"60\",\"64\",\"62\",\"63\",\"61\",\"65\",\"66\",\"67\"]}','2017-08-14 18:41:45',0),(84,'127.0.0.1',0,'','','common/main/login','{}','2017-08-14 18:41:48',0),(85,'127.0.0.1',2,'管理员','','common/main/index','{}','2017-08-14 18:41:52',0),(86,'127.0.0.1',2,'管理员','资源查看','common/resource/index','{}','2017-08-14 18:43:23',0),(87,'127.0.0.1',2,'管理员','','common/resource/0/toAddChild/0','{}','2017-08-14 18:43:28',0),(88,'127.0.0.1',2,'管理员','资源新增','common/resource/addChild','{\"tokenKey\":[\"b66c2adc-c8f3-4b03-803e-6f63fcb76cf4\"],\"tokenValue\":[\"b13c3f21-4f99-4503-b378-54af118184cf\"],\"id\":[\"\"],\"pid\":[\"0\"],\"pids\":[\"0\"],\"name\":[\"文件管理\"],\"selpid\":[\"root\"],\"type\":[\"menu\"],\"url\":[\"\"],\"percode\":[\"\"],\"sortstring\":[\"5\"],\"available\":[\"1\"]}','2017-08-14 18:43:38',0),(89,'127.0.0.1',2,'管理员','资源查看','common/resource/index','{}','2017-08-14 18:43:38',0),(90,'127.0.0.1',2,'管理员','','common/resource/68/toAddChild/0,68','{}','2017-08-14 18:43:41',0),(91,'127.0.0.1',2,'管理员','资源新增','common/resource/addChild','{\"tokenKey\":[\"3fd44c77-4f28-4433-b099-b9689445055d\"],\"tokenValue\":[\"e15cc0e9-f9f2-4258-89ae-cb8048df5ccc\"],\"id\":[\"\"],\"pid\":[\"68\"],\"pids\":[\"0,68\"],\"name\":[\"文件上传\"],\"selpid\":[\"文件管理\"],\"type\":[\"menu\"],\"url\":[\"upload/index\"],\"percode\":[\"\"],\"sortstring\":[\"\"],\"available\":[\"1\"]}','2017-08-14 18:44:00',0),(92,'127.0.0.1',2,'管理员','资源查看','common/resource/index','{}','2017-08-14 18:44:00',0),(93,'127.0.0.1',2,'管理员','','common/resource/68/toAddChild/0,68','{}','2017-08-14 18:44:02',0),(94,'127.0.0.1',2,'管理员','','common/resource/68/toUpdateChild/0,68','{}','2017-08-14 18:44:15',0),(95,'127.0.0.1',2,'管理员','资源修改','common/resource/updateChild','{\"tokenKey\":[\"755aed01-4452-45c8-a80f-56c75981e0b3\"],\"tokenValue\":[\"7ec8916c-f836-46e9-a3f6-1163c6d9d5da\"],\"id\":[\"68\"],\"pid\":[\"0\"],\"pids\":[\"0,68\"],\"name\":[\"文件管理\"],\"selpid\":[\"\"],\"type\":[\"menu\"],\"url\":[\"upload/fileManagement\"],\"percode\":[\"\"],\"sortstring\":[\"5\"],\"available\":[\"1\"]}','2017-08-14 18:44:49',0),(96,'127.0.0.1',2,'管理员','资源查看','common/resource/index','{}','2017-08-14 18:44:49',0),(97,'127.0.0.1',2,'管理员','角色管理','common/role/index','{}','2017-08-14 18:45:51',0),(98,'127.0.0.1',2,'管理员','','common/role/1/authConfig','{}','2017-08-14 18:45:52',0),(99,'127.0.0.1',2,'管理员','','common/role/1/saveAuth','{\"resIds\":[\"1\",\"11\",\"13\",\"14\",\"27\",\"12\",\"21\",\"22\",\"23\",\"24\",\"26\",\"28\",\"29\",\"30\",\"31\",\"32\",\"33\",\"34\",\"35\",\"36\",\"37\",\"48\",\"49\",\"50\",\"51\",\"52\",\"53\",\"46\",\"47\",\"55\",\"54\",\"57\",\"58\",\"56\",\"59\",\"39\",\"45\",\"41\",\"42\",\"43\",\"44\",\"60\",\"64\",\"62\",\"63\",\"61\",\"65\",\"66\",\"67\",\"68\",\"69\"]}','2017-08-14 18:45:57',0),(100,'127.0.0.1',0,'','','common/main/login','{}','2017-08-14 18:46:00',0),(101,'127.0.0.1',2,'管理员','','common/main/index','{}','2017-08-14 18:46:04',0),(102,'127.0.0.1',2,'管理员','文件管理','upload/fileManagement','{}','2017-08-14 18:46:06',0),(103,'127.0.0.1',2,'管理员','文件上传','upload/index','{}','2017-08-14 18:46:08',0),(104,'127.0.0.1',2,'管理员','基础数据','common/baseData/index','{}','2017-08-14 18:46:31',0),(105,'127.0.0.1',2,'管理员','基础数据','common/baseData/index','{\"tokenKey\":[\"fb1e1cb6-f2b1-4ea0-abdb-dda9035c26ce\"],\"tokenValue\":[\"ec81e891-2c3d-449d-a37e-9d2ede329dbc\"],\"key\":[\"file_type\"],\"delFlag\":[\"-1\"],\"pageSize\":[\"20\"],\"pageNo\":[\"1\"]}','2017-08-14 18:46:36',0),(106,'127.0.0.1',2,'管理员','','common/baseData/add','{}','2017-08-14 18:46:38',0),(107,'127.0.0.1',2,'管理员','','common/baseData/add','{\"id\":[\"\"],\"tokenKey\":[\"b30b17fd-c1ec-4ec5-a26e-1d0c4cd60550\"],\"seq\":[\"\"],\"value\":[\"音乐\"],\"tokenValue\":[\"6fab30b7-9679-4e65-ae63-37121c9ad1a3\"],\"key\":[\"file_type\"],\"url\":[\"\"]}','2017-08-14 18:46:50',0),(108,'127.0.0.1',2,'管理员','基础数据','common/baseData/index','{\"tokenKey\":[\"399464c9-0b11-45ff-b32b-39efe7199f90\"],\"tokenValue\":[\"49d9d53a-8e86-4fda-908e-ff715034caba\"],\"key\":[\"file_type\"],\"delFlag\":[\"-1\"],\"pageSize\":[\"20\"],\"pageNo\":[\"1\"]}','2017-08-14 18:46:50',0),(109,'127.0.0.1',2,'管理员','','common/baseData/add','{}','2017-08-14 18:46:52',0),(110,'127.0.0.1',2,'管理员','','common/baseData/add','{\"id\":[\"\"],\"tokenKey\":[\"3d59d46f-45b2-4db6-be22-756f236f1f99\"],\"seq\":[\"\"],\"value\":[\"电影\"],\"tokenValue\":[\"0e6785e6-af6b-4550-bda4-22bc7fc41ef0\"],\"key\":[\"file_type\"],\"url\":[\"\"]}','2017-08-14 18:46:56',0),(111,'127.0.0.1',2,'管理员','基础数据','common/baseData/index','{\"tokenKey\":[\"cd846886-8650-4c1a-a580-697a513c94bb\"],\"tokenValue\":[\"5421ff85-bee2-481d-9574-7e6010401113\"],\"key\":[\"file_type\"],\"delFlag\":[\"-1\"],\"pageSize\":[\"20\"],\"pageNo\":[\"1\"]}','2017-08-14 18:46:56',0),(112,'127.0.0.1',2,'管理员','','common/baseData/add','{}','2017-08-14 18:46:57',0),(113,'127.0.0.1',2,'管理员','','common/baseData/add','{\"id\":[\"\"],\"tokenKey\":[\"3635a685-8282-479c-ad27-3b25a37ff887\"],\"seq\":[\"\"],\"value\":[\"软件\"],\"tokenValue\":[\"d10c9b40-319e-42a0-a2f1-1768a6b86161\"],\"key\":[\"file_type\"],\"url\":[\"\"]}','2017-08-14 18:47:02',0),(114,'127.0.0.1',2,'管理员','基础数据','common/baseData/index','{\"tokenKey\":[\"7f6ce318-ce87-4af1-a4a6-0113518ccd5d\"],\"tokenValue\":[\"db59c2d8-b348-405d-a8e7-2d3f6843242b\"],\"key\":[\"file_type\"],\"delFlag\":[\"-1\"],\"pageSize\":[\"20\"],\"pageNo\":[\"1\"]}','2017-08-14 18:47:02',0),(115,'127.0.0.1',2,'管理员','资源查看','common/resource/index','{}','2017-08-14 18:47:29',0),(116,'127.0.0.1',2,'管理员','','common/baseData/7/update','{}','2017-08-14 18:47:48',0),(117,'127.0.0.1',2,'管理员','','common/baseData/update','{\"id\":[\"7\"],\"tokenKey\":[\"7a90fa03-11ab-45a0-91a0-b41d3baf23e9\"],\"seq\":[\"0\"],\"value\":[\"软件\"],\"tokenValue\":[\"08ad740d-1f51-4e6c-834f-7a6d7d05a57f\"],\"key\":[\"file_type\"],\"url\":[\"\"]}','2017-08-14 18:47:56',0),(118,'127.0.0.1',2,'管理员','基础数据','common/baseData/index','{\"tokenKey\":[\"2cbefcca-0338-4344-a137-49520ba83d47\"],\"tokenValue\":[\"c3758d66-7a1a-4d61-a80a-ef9ed0f5754b\"],\"key\":[\"file_type\"],\"delFlag\":[\"-1\"],\"pageSize\":[\"20\"],\"pageNo\":[\"1\"]}','2017-08-14 18:47:56',0),(119,'127.0.0.1',2,'管理员','','common/baseData/6/update','{}','2017-08-14 18:47:58',0),(120,'127.0.0.1',2,'管理员','','common/baseData/update','{\"id\":[\"6\"],\"tokenKey\":[\"1fdcc50b-f91f-4e93-af81-2962b6681f48\"],\"seq\":[\"0\"],\"value\":[\"电影\"],\"tokenValue\":[\"f2c4d5fb-4cac-4fcb-874a-80f4b014e481\"],\"key\":[\"file_type\"],\"url\":[\"\"]}','2017-08-14 18:48:02',0),(121,'127.0.0.1',2,'管理员','基础数据','common/baseData/index','{\"tokenKey\":[\"9dc9ef08-fbfd-4769-92ba-0e4ab9f08efa\"],\"tokenValue\":[\"ef515387-d904-4912-b347-7772f28dc086\"],\"key\":[\"file_type\"],\"delFlag\":[\"-1\"],\"pageSize\":[\"20\"],\"pageNo\":[\"1\"]}','2017-08-14 18:48:02',0),(122,'127.0.0.1',2,'管理员','','common/baseData/5/update','{}','2017-08-14 18:48:03',0),(123,'127.0.0.1',2,'管理员','','common/baseData/update','{\"id\":[\"5\"],\"tokenKey\":[\"1d877049-87b1-47c9-94e6-2984f3a61fb6\"],\"seq\":[\"0\"],\"value\":[\"音乐\"],\"tokenValue\":[\"d1d32044-c6a0-47c6-8d76-2a90dc52b256\"],\"key\":[\"file_type\"],\"url\":[\"\"]}','2017-08-14 18:48:06',0),(124,'127.0.0.1',2,'管理员','基础数据','common/baseData/index','{\"tokenKey\":[\"21eea464-ccde-4cca-b264-25bcf8047ea9\"],\"tokenValue\":[\"83bf3dd3-9aa4-46d2-abf9-55d84021ec58\"],\"key\":[\"file_type\"],\"delFlag\":[\"-1\"],\"pageSize\":[\"20\"],\"pageNo\":[\"1\"]}','2017-08-14 18:48:07',0),(125,'127.0.0.1',2,'管理员','','common/resource/68/toUpdateChild/0,68','{}','2017-08-14 18:49:13',0),(126,'127.0.0.1',2,'管理员','','common/main/index','{}','2017-08-14 18:50:49',0),(127,'127.0.0.1',2,'管理员','文件上传','upload/index','{}','2017-08-14 18:50:52',0),(128,'127.0.0.1',2,'管理员','资源查看','common/resource/index','{}','2017-08-14 18:57:25',0),(129,'127.0.0.1',0,'','','common/main/login;JSESSIONID=1ce8d84e-b1cf-4d95-85b6-87d6e1def5f6','{}','2017-08-14 20:01:50',0),(130,'127.0.0.1',2,'管理员','','common/main/index','{}','2017-08-14 20:01:56',0),(131,'127.0.0.1',2,'管理员','资源查看','common/resource/index','{}','2017-08-14 20:01:58',0),(132,'127.0.0.1',2,'管理员','','common/resource/11/toUpdateChild/0,1,11','{}','2017-08-14 20:02:03',0),(133,'127.0.0.1',2,'管理员','资源修改','common/resource/updateChild','{\"tokenKey\":[\"08b678bf-8150-4540-914c-7028a7edb2eb\"],\"tokenValue\":[\"5a05e9c4-a879-4e1a-8842-e17dd657bf6b\"],\"id\":[\"11\"],\"pid\":[\"1\"],\"pids\":[\"0,1,11\"],\"name\":[\"资源管理\"],\"selpid\":[\"系统管理\"],\"type\":[\"menu\"],\"url\":[\"common/resource/default\"],\"percode\":[\"res:view\"],\"sortstring\":[\"11\"],\"available\":[\"1\"]}','2017-08-14 20:02:34',0),(134,'127.0.0.1',2,'管理员','资源查看','common/resource/index','{}','2017-08-14 20:02:34',0),(135,'127.0.0.1',2,'管理员','','common/main/index','{}','2017-08-14 20:02:36',0),(136,'127.0.0.1',0,'','','common/main/login;JSESSIONID=9f2284b4-252d-4c3a-b917-4470050dbab8','{}','2017-08-14 20:06:21',0),(137,'127.0.0.1',2,'管理员','','common/main/index','{}','2017-08-14 20:06:26',0),(138,'127.0.0.1',2,'管理员','基础数据','common/baseData/index','{}','2017-08-14 20:11:41',0),(139,'127.0.0.1',2,'管理员','','common/baseData/7/update','{}','2017-08-14 20:11:50',0),(140,'127.0.0.1',2,'管理员','','common/baseData/update','{\"id\":[\"7\"],\"tokenKey\":[\"2341aba8-9550-47c4-a53e-430b43c3fe29\"],\"seq\":[\"0\"],\"value\":[\"{\\\"id\\\":\\\"\\\",\\\"name\\\":\\\"软件\\\",\\\"url\\\":\\\"\\\"}\"],\"tokenValue\":[\"ab65c839-4459-4988-b863-216043725856\"],\"key\":[\"file_type\"],\"url\":[\"2017/8/14/18/1e0a91c8-4eb4-4ae4-9552-b278f17a47f1.jpg\"]}','2017-08-14 20:13:36',0),(141,'127.0.0.1',2,'管理员','基础数据','common/baseData/index','{\"tokenKey\":[\"94bdd554-e3dc-4b26-9b92-d7937edce3ba\"],\"tokenValue\":[\"d20e004f-ff75-415c-b67a-d2eae510a1e8\"],\"key\":[\"\"],\"delFlag\":[\"-1\"],\"pageSize\":[\"20\"],\"pageNo\":[\"1\"]}','2017-08-14 20:13:37',0),(142,'127.0.0.1',2,'管理员','','common/baseData/6/update','{}','2017-08-14 20:13:41',0),(143,'127.0.0.1',2,'管理员','','common/baseData/update','{\"id\":[\"6\"],\"tokenKey\":[\"3f57ce4f-ba7b-4b1c-893a-4218ebdc0531\"],\"seq\":[\"0\"],\"value\":[\"{\\\"id\\\":\\\"\\\",\\\"name\\\":\\\"电影\\\",\\\"url\\\":\\\"\\\"}\"],\"tokenValue\":[\"c4ab6bb1-dd54-4377-b4a5-08d5acf5b00a\"],\"key\":[\"file_type\"],\"url\":[\"2017/8/14/18/ad6b50b7-28ea-45ac-bb2b-4e3f21ed82a5.jpg\"]}','2017-08-14 20:13:50',0),(144,'127.0.0.1',2,'管理员','基础数据','common/baseData/index','{\"tokenKey\":[\"799f0511-25a6-4f8b-88ba-7fb6769bb161\"],\"tokenValue\":[\"e3018f2f-e597-4925-84a6-412822680224\"],\"key\":[\"\"],\"delFlag\":[\"-1\"],\"pageSize\":[\"20\"],\"pageNo\":[\"1\"]}','2017-08-14 20:13:50',0),(145,'127.0.0.1',2,'管理员','','common/baseData/5/update','{}','2017-08-14 20:13:52',0),(146,'127.0.0.1',2,'管理员','','common/baseData/5/update','{}','2017-08-14 20:14:04',0),(147,'127.0.0.1',2,'管理员','','common/baseData/update','{\"id\":[\"5\"],\"tokenKey\":[\"fdfdb22c-3e96-4a3f-ac1f-27146999f364\"],\"seq\":[\"0\"],\"value\":[\"{\\\"id\\\":\\\"\\\",\\\"name\\\":\\\"音乐\\\",\\\"url\\\":\\\"\\\"} \"],\"tokenValue\":[\"74602f71-a114-466d-ace7-f296049db754\"],\"key\":[\"file_type\"],\"url\":[\"2017/8/14/18/6aeda7f5-f224-417b-a485-9f254e05b80b.jpg\"]}','2017-08-14 20:14:13',0),(148,'127.0.0.1',2,'管理员','基础数据','common/baseData/index','{\"tokenKey\":[\"088ab5d6-a3b2-4e3f-9adc-722352d90e1f\"],\"tokenValue\":[\"d5912d90-3636-4d4b-8492-b5f49c6e6cd5\"],\"key\":[\"\"],\"delFlag\":[\"-1\"],\"pageSize\":[\"20\"],\"pageNo\":[\"1\"]}','2017-08-14 20:14:13',0),(149,'127.0.0.1',2,'管理员','资源管理','common/resource/default','{}','2017-08-14 20:14:28',0),(150,'127.0.0.1',2,'管理员','','common/main/index','{}','2017-08-14 20:17:54',0),(151,'127.0.0.1',2,'管理员','资源管理','common/resource/default','{}','2017-08-14 20:17:59',0),(152,'127.0.0.1',2,'管理员','','index/7','{}','2017-08-14 20:18:00',0),(153,'127.0.0.1',2,'管理员','','index/6','{}','2017-08-14 20:18:08',0),(154,'127.0.0.1',2,'管理员','','common/main/index','{}','2017-08-14 20:18:56',0),(155,'127.0.0.1',2,'管理员','资源管理','common/resource/default','{}','2017-08-14 20:18:59',0),(156,'127.0.0.1',2,'管理员','','index/7','{}','2017-08-14 20:19:00',0),(157,'127.0.0.1',2,'管理员','','index/6','{}','2017-08-14 20:19:03',0),(158,'127.0.0.1',2,'管理员','','common/main/index','{}','2017-08-14 20:19:06',0),(159,'127.0.0.1',2,'管理员','资源管理','common/resource/default','{}','2017-08-14 20:19:17',0),(160,'127.0.0.1',2,'管理员','','index/7','{}','2017-08-14 20:19:18',0),(161,'127.0.0.1',2,'管理员','','index/6','{}','2017-08-14 20:19:20',0),(162,'127.0.0.1',2,'管理员','','index/5','{}','2017-08-14 20:19:22',0),(163,'127.0.0.1',0,'','','common/main/login','{}','2017-08-14 20:19:36',0),(164,'127.0.0.1',2,'管理员','','common/main/index','{}','2017-08-14 20:19:43',0),(165,'127.0.0.1',2,'管理员','资源管理','common/resource/default','{}','2017-08-14 20:19:46',0),(166,'127.0.0.1',2,'管理员','','index/7','{}','2017-08-14 20:19:47',0),(167,'127.0.0.1',2,'管理员','','index/6','{}','2017-08-14 20:19:51',0),(168,'127.0.0.1',2,'管理员','','index/5','{}','2017-08-14 20:19:54',0),(169,'127.0.0.1',2,'管理员','','common/main/index','{}','2017-08-14 20:20:59',0),(170,'127.0.0.1',2,'管理员','基础数据','common/baseData/index','{}','2017-08-14 20:21:16',0),(171,'127.0.0.1',2,'管理员','','common/baseData/7/update','{}','2017-08-14 20:21:20',0),(172,'127.0.0.1',2,'管理员','我的业务','leaveBill/index/64','{}','2017-08-14 20:22:28',0),(173,'127.0.0.1',2,'管理员','','common/main/index','{}','2017-08-14 20:22:49',0),(174,'127.0.0.1',2,'管理员','','common/main/index','{}','2017-08-14 20:27:16',0),(175,'127.0.0.1',2,'管理员','资源管理','common/resource/default','{}','2017-08-14 20:29:42',0),(176,'127.0.0.1',2,'管理员','','common/resource/index/7','{}','2017-08-14 20:29:44',0),(177,'127.0.0.1',2,'管理员','','common/resource/index/6','{}','2017-08-14 20:29:48',0),(178,'127.0.0.1',2,'管理员','','common/resource/index/5','{}','2017-08-14 20:29:50',0),(179,'127.0.0.1',2,'管理员','','common/resource/0/7/toAddChild/0','{}','2017-08-14 20:29:53',0),(180,'127.0.0.1',2,'管理员','','common/main/index','{}','2017-08-14 20:29:59',0),(181,'127.0.0.1',2,'管理员','资源管理','common/resource/default','{}','2017-08-14 20:30:02',0),(182,'127.0.0.1',2,'管理员','','common/resource/index/7','{}','2017-08-14 20:30:02',0),(183,'127.0.0.1',2,'管理员','','common/resource/0/7/toAddChild/0','{}','2017-08-14 20:30:04',0),(184,'127.0.0.1',2,'管理员','','common/resource/addCategoryChild','{\"tokenKey\":[\"541b1d0d-bdef-456c-bfa1-05e1743d4b14\"],\"tokenValue\":[\"05fc4c49-c687-48fe-9526-aac467a1128d\"],\"id\":[\"\"],\"parentid\":[\"0\"],\"parentids\":[\"0\"],\"cid\":[\"7\"],\"name\":[\"开发\"],\"selpid\":[\"root\"],\"url\":[\"\"],\"sortstring\":[\"\"],\"available\":[\"1\"]}','2017-08-14 20:30:26',0),(185,'127.0.0.1',2,'管理员','','common/resource/index/7','{}','2017-08-14 20:30:26',0),(186,'127.0.0.1',2,'管理员','','common/resource/0/7/toAddChild/0','{}','2017-08-14 20:30:28',0),(187,'127.0.0.1',2,'管理员','','common/resource/addCategoryChild','{\"tokenKey\":[\"a09ed54b-b61d-4e61-b6a7-d8f840000864\"],\"tokenValue\":[\"62c50d0b-a831-46a7-96ae-4a316603dc10\"],\"id\":[\"\"],\"parentid\":[\"0\"],\"parentids\":[\"0\"],\"cid\":[\"7\"],\"name\":[\"网络\"],\"selpid\":[\"root\"],\"url\":[\"\"],\"sortstring\":[\"\"],\"available\":[\"1\"]}','2017-08-14 20:30:37',0),(188,'127.0.0.1',2,'管理员','','common/resource/index/7','{}','2017-08-14 20:30:37',0),(189,'127.0.0.1',2,'管理员','','common/resource/1/7/toAddChild/0,1','{}','2017-08-14 20:30:39',0),(190,'127.0.0.1',2,'管理员','','common/resource/addCategoryChild','{\"tokenKey\":[\"9e00d1bd-d8fa-4b6c-9c4f-028fcf7dccdb\"],\"tokenValue\":[\"9a06e77f-baff-4a94-a1cd-3e20963c4b86\"],\"id\":[\"\"],\"parentid\":[\"1\"],\"parentids\":[\"0,1\"],\"cid\":[\"7\"],\"name\":[\"java\"],\"selpid\":[\"系统管理\"],\"url\":[\"\"],\"sortstring\":[\"\"],\"available\":[\"1\"]}','2017-08-14 20:30:43',0),(191,'127.0.0.1',2,'管理员','','common/resource/index/7','{}','2017-08-14 20:30:43',0),(192,'127.0.0.1',2,'管理员','','common/resource/index/6','{}','2017-08-14 20:30:45',0),(193,'127.0.0.1',2,'管理员','','common/resource/0/6/toAddChild/0','{}','2017-08-14 20:30:48',0),(194,'127.0.0.1',2,'管理员','','common/resource/addCategoryChild','{\"tokenKey\":[\"9428fc92-31e0-4b1b-b3f9-291d93b54ea2\"],\"tokenValue\":[\"9ecd6277-e83a-4413-b01e-03444874508f\"],\"id\":[\"\"],\"parentid\":[\"0\"],\"parentids\":[\"0\"],\"cid\":[\"6\"],\"name\":[\"动作\"],\"selpid\":[\"root\"],\"url\":[\"\"],\"sortstring\":[\"\"],\"available\":[\"1\"]}','2017-08-14 20:30:52',0),(195,'127.0.0.1',2,'管理员','','common/resource/index/6','{}','2017-08-14 20:30:53',0),(196,'127.0.0.1',2,'管理员','','common/resource/index/5','{}','2017-08-14 20:30:54',0),(197,'127.0.0.1',2,'管理员','','common/resource/0/5/toAddChild/0','{}','2017-08-14 20:30:56',0),(198,'127.0.0.1',2,'管理员','','common/resource/addCategoryChild','{\"tokenKey\":[\"67e84e35-69cb-4be2-84dc-e9b192f10564\"],\"tokenValue\":[\"b391ac0d-63dc-4f87-b524-ccd09044c4b1\"],\"id\":[\"\"],\"parentid\":[\"0\"],\"parentids\":[\"0\"],\"cid\":[\"5\"],\"name\":[\"流行\"],\"selpid\":[\"root\"],\"url\":[\"\"],\"sortstring\":[\"\"],\"available\":[\"1\"]}','2017-08-14 20:31:01',0),(199,'127.0.0.1',2,'管理员','','common/resource/index/5','{}','2017-08-14 20:31:01',0),(200,'127.0.0.1',2,'管理员','资源管理','common/resource/default','{}','2017-08-14 20:31:04',0),(201,'127.0.0.1',2,'管理员','','common/resource/index/7','{}','2017-08-14 20:31:04',0),(202,'127.0.0.1',2,'管理员','','common/resource/index/6','{}','2017-08-14 20:31:06',0),(203,'127.0.0.1',2,'管理员','','common/resource/index/5','{}','2017-08-14 20:31:06',0),(204,'127.0.0.1',2,'管理员','文件管理','upload/fileManagement','{}','2017-08-14 20:31:09',0),(205,'127.0.0.1',2,'管理员','','common/resource/3/7/toUpdateChild/0,1,3','{}','2017-08-14 20:32:23',0),(206,'127.0.0.1',2,'管理员','','common/resource/updateCategoryChild','{\"tokenKey\":[\"b4361f01-0742-4398-af2e-c101dc1262ff\"],\"tokenValue\":[\"9fd6943e-64fd-4fac-9ff4-f326801971cd\"],\"id\":[\"3\"],\"parentid\":[\"1\"],\"parentids\":[\"0,1,3\"],\"cid\":[\"7\"],\"name\":[\"java\"],\"selpid\":[\"开发\"],\"url\":[\"file/index/7/3\"],\"sortstring\":[\"\"],\"available\":[\"1\"]}','2017-08-14 20:33:59',0),(207,'127.0.0.1',2,'管理员','','common/resource/index/7','{}','2017-08-14 20:33:59',0),(208,'127.0.0.1',2,'管理员','文件管理','upload/fileManagement','{}','2017-08-14 20:34:03',0),(209,'127.0.0.1',2,'管理员','文件管理','upload/fileManagement','{}','2017-08-14 20:34:41',0),(210,'127.0.0.1',2,'管理员','文件管理','upload/fileManagement','{}','2017-08-14 20:39:42',0),(211,'127.0.0.1',2,'管理员','','file/index/3/7','{}','2017-08-14 20:39:44',0),(212,'127.0.0.1',0,'','','common/main/login;JSESSIONID=a37b3b7e-0ebd-4cac-9d48-dce40a678311','{}','2017-08-14 20:43:48',0),(213,'127.0.0.1',2,'管理员','','common/main/index','{}','2017-08-14 20:43:52',0),(214,'127.0.0.1',2,'管理员','文件管理','upload/fileManagement','{}','2017-08-14 20:43:55',0),(215,'127.0.0.1',2,'管理员','','file/index/3/7','{}','2017-08-14 20:43:57',0),(216,'127.0.0.1',2,'管理员','','file/index/3/7','{}','2017-08-14 20:43:59',0),(217,'127.0.0.1',2,'管理员','','file/index/3/7','{}','2017-08-14 20:44:04',0),(218,'127.0.0.1',2,'管理员','','file/addUI/3/7','{}','2017-08-14 20:44:06',0),(219,'127.0.0.1',2,'管理员','','upload/batch','{}','2017-08-14 20:44:47',0),(220,'127.0.0.1',2,'管理员','','upload/batch','{}','2017-08-14 20:44:58',0),(221,'127.0.0.1',2,'管理员','文件管理','upload/fileManagement','{}','2017-08-14 20:45:06',0),(222,'127.0.0.1',2,'管理员','','file/index/3/7','{}','2017-08-14 20:45:13',0),(223,'127.0.0.1',2,'管理员','文件管理','upload/fileManagement','{}','2017-08-14 20:45:19',0),(224,'127.0.0.1',2,'管理员','','file/index/3/7','{}','2017-08-14 20:45:22',0),(225,'127.0.0.1',2,'管理员','','file/addUI/3/7','{}','2017-08-14 20:45:49',0),(226,'127.0.0.1',2,'管理员','','common/main/index','{}','2017-08-14 20:46:49',0),(227,'127.0.0.1',2,'管理员','文件管理','upload/fileManagement','{}','2017-08-14 20:46:53',0),(228,'127.0.0.1',2,'管理员','','file/index/3/7','{}','2017-08-14 20:46:55',0),(229,'127.0.0.1',2,'管理员','','file/addUI/3/7','{}','2017-08-14 20:46:57',0),(230,'127.0.0.1',2,'管理员','','file/getStatus','{}','2017-08-14 20:47:01',0),(231,'127.0.0.1',2,'管理员','','file/upload','{\"cid\":[\"7\"],\"typeId\":[\"3\"]}','2017-08-14 20:47:01',0),(232,'127.0.0.1',2,'管理员','','file/getStatus','{}','2017-08-14 20:47:01',0),(233,'127.0.0.1',2,'管理员','','file/getStatus','{}','2017-08-14 20:47:01',0),(234,'127.0.0.1',2,'管理员','','file/getStatus','{}','2017-08-14 20:47:01',0),(235,'127.0.0.1',2,'管理员','','file/getStatus','{}','2017-08-14 20:47:01',0),(236,'127.0.0.1',2,'管理员','','file/index/3/7','{}','2017-08-14 20:47:04',0),(237,'127.0.0.1',2,'管理员','','common/file/%E4%B8%8B%E8%BD%BD%E6%96%87%E4%BB%B6/chgFlag/upload/1/download','{}','2017-08-14 20:47:16',0),(238,'127.0.0.1',2,'管理员','','common/file/%E4%B8%8B%E8%BD%BD%E6%96%87%E4%BB%B6/chgFlag/upload/1/download','{}','2017-08-14 20:47:17',0),(239,'127.0.0.1',2,'管理员','','file/addUI/3/7','{}','2017-08-14 20:47:27',0),(240,'127.0.0.1',2,'管理员','','file/getStatus','{}','2017-08-14 20:47:50',0),(241,'127.0.0.1',2,'管理员','','file/getStatus','{}','2017-08-14 20:47:50',0),(242,'127.0.0.1',2,'管理员','','file/getStatus','{}','2017-08-14 20:47:50',0),(243,'127.0.0.1',2,'管理员','','file/getStatus','{}','2017-08-14 20:47:50',0),(244,'127.0.0.1',2,'管理员','','file/getStatus','{}','2017-08-14 20:47:50',0),(245,'127.0.0.1',2,'管理员','','file/getStatus','{}','2017-08-14 20:47:50',0),(246,'127.0.0.1',2,'管理员','','file/getStatus','{}','2017-08-14 20:47:50',0),(247,'127.0.0.1',2,'管理员','','file/getStatus','{}','2017-08-14 20:47:50',0),(248,'127.0.0.1',2,'管理员','','file/getStatus','{}','2017-08-14 20:47:50',0),(249,'127.0.0.1',2,'管理员','','file/getStatus','{}','2017-08-14 20:47:50',0),(250,'127.0.0.1',2,'管理员','','file/getStatus','{}','2017-08-14 20:47:51',0),(251,'127.0.0.1',2,'管理员','','file/getStatus','{}','2017-08-14 20:47:51',0),(252,'127.0.0.1',2,'管理员','','file/getStatus','{}','2017-08-14 20:47:51',0),(253,'127.0.0.1',2,'管理员','','file/getStatus','{}','2017-08-14 20:47:51',0),(254,'127.0.0.1',2,'管理员','','file/getStatus','{}','2017-08-14 20:47:51',0),(255,'127.0.0.1',2,'管理员','','file/getStatus','{}','2017-08-14 20:47:51',0),(256,'127.0.0.1',2,'管理员','','file/getStatus','{}','2017-08-14 20:47:51',0),(257,'127.0.0.1',2,'管理员','','file/getStatus','{}','2017-08-14 20:47:51',0),(258,'127.0.0.1',2,'管理员','','file/getStatus','{}','2017-08-14 20:47:51',0),(259,'127.0.0.1',2,'管理员','','file/getStatus','{}','2017-08-14 20:47:51',0),(260,'127.0.0.1',2,'管理员','','file/getStatus','{}','2017-08-14 20:47:52',0),(261,'127.0.0.1',2,'管理员','','file/getStatus','{}','2017-08-14 20:47:52',0),(262,'127.0.0.1',2,'管理员','','file/getStatus','{}','2017-08-14 20:47:52',0),(263,'127.0.0.1',2,'管理员','','file/getStatus','{}','2017-08-14 20:47:52',0),(264,'127.0.0.1',2,'管理员','','file/getStatus','{}','2017-08-14 20:47:52',0),(265,'127.0.0.1',2,'管理员','','file/getStatus','{}','2017-08-14 20:47:52',0),(266,'127.0.0.1',2,'管理员','','file/getStatus','{}','2017-08-14 20:47:52',0),(267,'127.0.0.1',2,'管理员','','file/getStatus','{}','2017-08-14 20:47:52',0),(268,'127.0.0.1',2,'管理员','','file/getStatus','{}','2017-08-14 20:47:52',0),(269,'127.0.0.1',2,'管理员','','file/getStatus','{}','2017-08-14 20:47:52',0),(270,'127.0.0.1',2,'管理员','','file/getStatus','{}','2017-08-14 20:47:53',0),(271,'127.0.0.1',2,'管理员','','file/getStatus','{}','2017-08-14 20:47:53',0),(272,'127.0.0.1',2,'管理员','','file/getStatus','{}','2017-08-14 20:47:53',0),(273,'127.0.0.1',2,'管理员','','file/getStatus','{}','2017-08-14 20:47:53',0),(274,'127.0.0.1',2,'管理员','','file/getStatus','{}','2017-08-14 20:47:53',0),(275,'127.0.0.1',2,'管理员','','file/getStatus','{}','2017-08-14 20:47:53',0),(276,'127.0.0.1',2,'管理员','','file/getStatus','{}','2017-08-14 20:47:53',0),(277,'127.0.0.1',2,'管理员','','file/getStatus','{}','2017-08-14 20:47:54',0),(278,'127.0.0.1',2,'管理员','','file/getStatus','{}','2017-08-14 20:47:54',0),(279,'127.0.0.1',2,'管理员','','file/getStatus','{}','2017-08-14 20:47:54',0),(280,'127.0.0.1',2,'管理员','','file/getStatus','{}','2017-08-14 20:47:54',0),(281,'127.0.0.1',2,'管理员','','file/getStatus','{}','2017-08-14 20:47:54',0),(282,'127.0.0.1',2,'管理员','','file/getStatus','{}','2017-08-14 20:47:54',0),(283,'127.0.0.1',2,'管理员','','file/getStatus','{}','2017-08-14 20:47:54',0),(284,'127.0.0.1',2,'管理员','','file/getStatus','{}','2017-08-14 20:47:54',0),(285,'127.0.0.1',2,'管理员','','file/upload','{\"cid\":[\"7\"],\"typeId\":[\"3\"]}','2017-08-14 20:47:54',0),(286,'127.0.0.1',2,'管理员','','file/index/3/7','{}','2017-08-14 20:47:58',0),(287,'127.0.0.1',2,'管理员','','common/file/2/delete','{}','2017-08-14 20:48:05',0),(288,'127.0.0.1',2,'管理员','','common/file/2/delete','{}','2017-08-14 20:48:08',0),(289,'127.0.0.1',2,'管理员','文件上传','upload/index','{}','2017-08-14 20:48:19',0),(290,'127.0.0.1',2,'管理员','资源管理','common/resource/default','{}','2017-08-14 20:49:42',0),(291,'127.0.0.1',2,'管理员','','common/resource/index/7','{}','2017-08-14 20:49:43',0),(292,'127.0.0.1',2,'管理员','','common/resource/index/6','{}','2017-08-14 20:50:00',0),(293,'127.0.0.1',2,'管理员','','common/resource/index/5','{}','2017-08-14 20:50:00',0),(294,'127.0.0.1',2,'管理员','基础数据','common/baseData/index','{}','2017-08-14 20:51:08',0),(295,'127.0.0.1',2,'管理员','','common/baseData/add','{}','2017-08-14 20:54:41',0),(296,'127.0.0.1',2,'管理员','','common/baseData/add','{\"id\":[\"\"],\"tokenKey\":[\"85056d1a-8f32-4fb7-9f68-bfccb214155d\"],\"seq\":[\"0\"],\"value\":[\"{\\\"id\\\":\\\"0\\\",\\\"name\\\":\\\"资源管理\\\",\\\"url\\\":\\\"common/resource/index\\\"} \"],\"tokenValue\":[\"55df0072-71c1-4387-90b3-090f445a4e1d\"],\"key\":[\"file_type\"],\"url\":[\"\"]}','2017-08-14 20:55:09',0),(297,'127.0.0.1',2,'管理员','基础数据','common/baseData/index','{\"tokenKey\":[\"32b7e509-784b-4ac0-a1f3-99bc3acaa03d\"],\"tokenValue\":[\"ec24a39b-d5df-4e35-9b9f-599763869d20\"],\"key\":[\"\"],\"delFlag\":[\"-1\"],\"pageSize\":[\"20\"],\"pageNo\":[\"1\"]}','2017-08-14 20:55:09',0),(298,'127.0.0.1',2,'管理员','','common/main/login;JSESSIONID=a37b3b7e-0ebd-4cac-9d48-dce40a678311','{}','2017-08-14 20:55:18',0),(299,'127.0.0.1',2,'管理员','','common/main/login','{\"username\":[\"admin\"],\"password\":[\"123456\"],\"randomcode\":[\"d92a\"]}','2017-08-14 20:55:23',0),(300,'127.0.0.1',2,'管理员','','common/main/login','{\"username\":[\"admin\"],\"password\":[\"123456\"],\"randomcode\":[\"d92a\"]}','2017-08-14 20:55:27',0),(301,'127.0.0.1',2,'管理员','','common/main/login','{\"username\":[\"admin\"],\"password\":[\"123456\"],\"randomcode\":[\"d92a\"]}','2017-08-14 20:55:29',0),(302,'127.0.0.1',2,'管理员','','common/main/login','{\"username\":[\"admin\"],\"password\":[\"123456\"],\"randomcode\":[\"2bae\"]}','2017-08-14 20:55:32',0),(303,'127.0.0.1',2,'管理员','','common/main/index;JSESSIONID=669d76bd-748e-4197-8b22-504ed8c233fa','{}','2017-08-14 20:55:38',0),(304,'127.0.0.1',2,'管理员','资源管理','common/resource/default','{}','2017-08-14 20:55:40',0),(305,'127.0.0.1',2,'管理员','资源查看','common/resource/index','{}','2017-08-14 20:55:41',0),(306,'127.0.0.1',2,'管理员','','common/resource/index/7','{}','2017-08-14 20:55:45',0),(307,'127.0.0.1',2,'管理员','','common/resource/index/6','{}','2017-08-14 20:55:46',0),(308,'127.0.0.1',2,'管理员','','common/resource/index/5','{}','2017-08-14 20:55:48',0),(309,'127.0.0.1',2,'管理员','文件管理','upload/fileManagement','{}','2017-08-14 20:55:51',0),(310,'127.0.0.1',2,'管理员','基础数据','common/baseData/index','{}','2017-08-14 20:56:08',0),(311,'127.0.0.1',2,'管理员','','common/baseData/8/update','{}','2017-08-14 20:57:19',0),(312,'127.0.0.1',2,'管理员','','common/baseData/8/chgFlag/1','{}','2017-08-14 20:57:29',0),(313,'127.0.0.1',2,'管理员','基础数据','common/baseData/index','{\"tokenKey\":[\"edac1928-9be4-457d-9cba-fb0f48e58574\"],\"tokenValue\":[\"d7238475-674b-4e59-8ea7-61b9a9aeb8ef\"],\"key\":[\"\"],\"delFlag\":[\"-1\"],\"pageSize\":[\"20\"],\"pageNo\":[\"1\"]}','2017-08-14 20:57:29',0),(314,'127.0.0.1',2,'管理员','文件管理','upload/fileManagement','{}','2017-08-14 20:57:32',0),(315,'127.0.0.1',2,'管理员','','common/main/index;JSESSIONID=669d76bd-748e-4197-8b22-504ed8c233fa','{}','2017-08-14 20:57:42',0),(316,'127.0.0.1',2,'管理员','基础数据','common/baseData/index','{}','2017-08-14 20:57:45',0),(317,'127.0.0.1',2,'管理员','资源管理','common/resource/default','{}','2017-08-14 20:57:48',0),(318,'127.0.0.1',2,'管理员','资源查看','common/resource/index','{}','2017-08-14 20:57:48',0),(319,'127.0.0.1',2,'管理员','','common/resource/index/7','{}','2017-08-14 20:57:50',0),(320,'127.0.0.1',2,'管理员','','common/resource/index/6','{}','2017-08-14 20:57:51',0),(321,'127.0.0.1',2,'管理员','','common/resource/index/5','{}','2017-08-14 20:57:52',0),(322,'127.0.0.1',2,'管理员','文件管理','upload/fileManagement','{}','2017-08-14 20:57:54',0),(323,'127.0.0.1',2,'管理员','','file/index/3/7','{}','2017-08-14 20:58:09',0),(324,'127.0.0.1',2,'管理员','','common/resource/67/toUpdateChild/0,67','{}','2017-08-14 21:01:21',0),(325,'127.0.0.1',2,'管理员','资源修改','common/resource/updateChild','{\"tokenKey\":[\"f3c1bd46-1c52-4045-829c-6851a5e2f4ff\"],\"tokenValue\":[\"1671f417-4004-4863-8321-447439b98192\"],\"id\":[\"67\"],\"pid\":[\"0\"],\"pids\":[\"0,67\"],\"name\":[\"api接口示例\"],\"selpid\":[\"\"],\"type\":[\"menu\"],\"url\":[\"interface/index\"],\"percode\":[\"\"],\"sortstring\":[\"4\"],\"available\":[\"1\"]}','2017-08-14 21:01:30',0),(326,'127.0.0.1',2,'管理员','资源查看','common/resource/index','{}','2017-08-14 21:01:31',0),(327,'127.0.0.1',2,'管理员','','common/main/index;JSESSIONID=669d76bd-748e-4197-8b22-504ed8c233fa','{}','2017-08-14 21:01:42',0),(328,'127.0.0.1',2,'管理员','api接口示例','interface/index','{}','2017-08-14 21:01:44',0),(329,'127.0.0.1',2,'管理员','','app/user/testList','{}','2017-08-14 21:02:00',0),(330,'127.0.0.1',2,'管理员','','app/user/test','{\"id\":[\"1\"],\"usercode\":[\"\"],\"username\":[\"\"]}','2017-08-14 21:02:08',0),(331,'127.0.0.1',2,'管理员','','app/user/testObj','{\"id\":[\"1\"],\"usercode\":[\"\"],\"username\":[\"\"]}','2017-08-14 21:02:10',0),(332,'127.0.0.1',2,'管理员','','app/user/test','{\"id\":[\"1\"],\"usercode\":[\"china\"],\"username\":[\"中国人\"]}','2017-08-14 21:02:18',0),(333,'127.0.0.1',2,'管理员','','app/user/testObj','{\"id\":[\"1\"],\"usercode\":[\"china\"],\"username\":[\"中国人\"]}','2017-08-14 21:02:19',0),(334,'127.0.0.1',2,'管理员','','app/user/test','{\"id\":[\"1\"],\"usercode\":[\"china\"],\"username\":[\"中国人\"]}','2017-08-14 21:02:21',0),(335,'127.0.0.1',2,'管理员','','app/user/testObj','{\"id\":[\"1\"],\"usercode\":[\"china\"],\"username\":[\"中国人\"]}','2017-08-14 21:02:21',0),(336,'127.0.0.1',2,'管理员','','app/user/testList','{}','2017-08-14 21:02:32',0),(337,'127.0.0.1',2,'管理员','','app/user/testList','{}','2017-08-14 21:02:34',0),(338,'127.0.0.1',2,'管理员','','app/user/testList','{}','2017-08-14 21:02:37',0),(339,'127.0.0.1',2,'管理员','','app/user/testList','{}','2017-08-14 21:02:39',0),(340,'127.0.0.1',2,'管理员','文件管理','upload/fileManagement','{}','2017-08-14 21:06:10',0),(341,'127.0.0.1',2,'管理员','资源管理','common/resource/default','{}','2017-08-14 21:06:15',0),(342,'127.0.0.1',2,'管理员','资源查看','common/resource/index','{}','2017-08-14 21:06:15',0),(343,'127.0.0.1',2,'管理员','','common/resource/68/toUpdateChild/0,68','{}','2017-08-14 21:06:23',0),(344,'127.0.0.1',2,'管理员','','common/resource/0/toAddChild/0','{}','2017-08-14 21:06:27',0),(345,'127.0.0.1',2,'管理员','资源新增','common/resource/addChild','{\"tokenKey\":[\"4a406fe9-c514-4bdf-8012-c1aaddf7a449\"],\"tokenValue\":[\"becb9c9c-68f5-424a-ae48-245b7f6e6411\"],\"id\":[\"\"],\"pid\":[\"0\"],\"pids\":[\"0\"],\"name\":[\"秒杀演示\"],\"selpid\":[\"root\"],\"type\":[\"menu\"],\"url\":[\"seckill/list\"],\"percode\":[\"\"],\"sortstring\":[\"7\"],\"available\":[\"1\"]}','2017-08-14 21:07:03',0),(346,'127.0.0.1',2,'管理员','资源查看','common/resource/index','{}','2017-08-14 21:07:03',0),(347,'127.0.0.1',2,'管理员','角色管理','common/role/index','{}','2017-08-14 21:07:09',0),(348,'127.0.0.1',2,'管理员','','common/role/1/authConfig','{}','2017-08-14 21:07:11',0),(349,'127.0.0.1',2,'管理员','','common/role/1/saveAuth','{\"resIds\":[\"1\",\"11\",\"13\",\"14\",\"27\",\"12\",\"21\",\"22\",\"23\",\"24\",\"26\",\"28\",\"29\",\"30\",\"31\",\"32\",\"33\",\"34\",\"35\",\"36\",\"37\",\"48\",\"49\",\"50\",\"51\",\"52\",\"53\",\"46\",\"47\",\"55\",\"54\",\"57\",\"58\",\"56\",\"59\",\"39\",\"45\",\"41\",\"42\",\"43\",\"44\",\"60\",\"64\",\"62\",\"63\",\"61\",\"65\",\"66\",\"67\",\"68\",\"69\",\"70\"]}','2017-08-14 21:07:14',0),(350,'127.0.0.1',0,'','','common/main/login','{}','2017-08-14 21:07:21',0),(351,'127.0.0.1',2,'管理员','','common/main/index','{}','2017-08-14 21:07:25',0),(352,'127.0.0.1',2,'管理员','秒杀演示','seckill/list','{}','2017-08-14 21:07:27',0),(353,'127.0.0.1',2,'管理员','','seckill/1004/detail','{}','2017-08-14 21:07:30',0),(354,'127.0.0.1',2,'管理员','','seckill/time/now','{}','2017-08-14 21:07:30',0),(355,'127.0.0.1',2,'管理员','','res/bootstrap/fonts/glyphicons-halflings-regular.woff2','{}','2017-08-14 21:07:30',0),(356,'127.0.0.1',2,'管理员','','seckill/1004/detail','{}','2017-08-14 21:07:35',0),(357,'127.0.0.1',2,'管理员','','seckill/time/now','{}','2017-08-14 21:07:36',0),(358,'127.0.0.1',2,'管理员','文件上传','upload/index','{}','2017-08-14 21:07:39',0),(359,'127.0.0.1',2,'管理员','文件管理','upload/fileManagement','{}','2017-08-14 21:07:40',0),(360,'127.0.0.1',2,'管理员','','file/index/3/7','{}','2017-08-14 21:07:42',0),(361,'127.0.0.1',2,'管理员','我的业务','leaveBill/index/64','{}','2017-08-14 21:07:45',0),(362,'127.0.0.1',2,'管理员','api接口示例','interface/index','{}','2017-08-14 21:08:02',0),(363,'127.0.0.1',0,'','','common/main/login;JSESSIONID=711f10ee-7b84-4f4b-b594-e7543b9dd220','{}','2017-08-14 21:23:51',0),(364,'127.0.0.1',0,'','','common/main/login','{}','2017-08-14 21:23:55',0),(365,'127.0.0.1',2,'管理员','','common/main/index','{}','2017-08-14 21:24:01',0),(366,'127.0.0.1',2,'管理员','资源管理','common/resource/default','{}','2017-08-14 21:24:03',0),(367,'127.0.0.1',2,'管理员','资源查看','common/resource/index','{}','2017-08-14 21:24:04',0),(368,'127.0.0.1',2,'管理员','角色管理','common/role/index','{}','2017-08-14 21:24:08',0),(369,'127.0.0.1',2,'管理员','','common/role/2/authConfig','{}','2017-08-14 21:24:12',0),(370,'127.0.0.1',2,'管理员','用户管理','common/user/index','{}','2017-08-14 21:24:17',0),(371,'127.0.0.1',2,'管理员','','common/user/add','{}','2017-08-14 21:24:21',0),(372,'127.0.0.1',2,'管理员','基础数据','common/baseData/index','{}','2017-08-14 21:24:32',0),(373,'127.0.0.1',2,'管理员','日志监控','common/main/startLog','{}','2017-08-14 21:24:39',0),(374,'127.0.0.1',2,'管理员','','ws','{\"uid\":[\"2\"]}','2017-08-14 21:24:40',0),(375,'127.0.0.1',2,'管理员','日志监控','common/main/startLog','{\"flag\":[\"0\"]}','2017-08-14 21:24:43',0),(376,'127.0.0.1',2,'管理员','日志查询','common/main/operLogList','{}','2017-08-14 21:24:45',0),(377,'127.0.0.1',2,'管理员','我的业务','leaveBill/index/64','{}','2017-08-14 21:24:51',0),(378,'127.0.0.1',2,'管理员','流程管理','proc/index','{}','2017-08-14 21:24:54',0),(379,'127.0.0.1',2,'管理员','','proc/deploy','{\"name\":[\"\"]}','2017-08-14 21:25:04',0),(380,'127.0.0.1',2,'管理员','流程管理','proc/index','{}','2017-08-14 21:25:04',0),(381,'127.0.0.1',2,'管理员','api接口示例','interface/index','{}','2017-08-14 21:25:14',0),(382,'127.0.0.1',2,'管理员','文件上传','upload/index','{}','2017-08-14 21:25:16',0),(383,'127.0.0.1',2,'管理员','文件管理','upload/fileManagement','{}','2017-08-14 21:25:18',0),(384,'127.0.0.1',2,'管理员','','file/index/3/7','{}','2017-08-14 21:25:25',0),(385,'127.0.0.1',2,'管理员','','common/resource/index/6','{}','2017-08-14 21:25:29',0),(386,'127.0.0.1',2,'管理员','','common/resource/0/6/toAddChild/0','{}','2017-08-14 21:25:32',0),(387,'127.0.0.1',2,'管理员','','common/resource/addCategoryChild','{\"tokenKey\":[\"3bf8e66a-6075-4b3e-8e7f-ed2b6efe6402\"],\"tokenValue\":[\"45e4c85d-23c5-4444-982e-c8a637bd8792\"],\"id\":[\"\"],\"parentid\":[\"0\"],\"parentids\":[\"0\"],\"cid\":[\"6\"],\"name\":[\"喜剧片\"],\"selpid\":[\"root\"],\"url\":[\"\"],\"sortstring\":[\"\"],\"available\":[\"1\"]}','2017-08-14 21:25:39',0),(388,'127.0.0.1',2,'管理员','','common/resource/index/6','{}','2017-08-14 21:25:39',0),(389,'127.0.0.1',2,'管理员','','common/resource/4/6/toAddChild/0,4','{}','2017-08-14 21:25:41',0),(390,'127.0.0.1',2,'管理员','','common/resource/addCategoryChild','{\"tokenKey\":[\"7cbcc365-95db-4f8d-ad77-f0722c6eaefd\"],\"tokenValue\":[\"924c66f5-5362-41bb-b560-72d0c017a678\"],\"id\":[\"\"],\"parentid\":[\"4\"],\"parentids\":[\"0,4\"],\"cid\":[\"6\"],\"name\":[\"李连杰\"],\"selpid\":[\"root\"],\"url\":[\"\"],\"sortstring\":[\"\"],\"available\":[\"1\"]}','2017-08-14 21:25:48',0),(391,'127.0.0.1',2,'管理员','','common/resource/index/6','{}','2017-08-14 21:25:48',0),(392,'127.0.0.1',2,'管理员','','common/resource/4/6/toAddChild/0,4','{}','2017-08-14 21:25:50',0),(393,'127.0.0.1',2,'管理员','','common/resource/addCategoryChild','{\"tokenKey\":[\"c737b40a-300e-4596-be28-9bc620d3e485\"],\"tokenValue\":[\"f7fd77d6-30a3-464b-86e3-a88c2b5d2423\"],\"id\":[\"\"],\"parentid\":[\"4\"],\"parentids\":[\"0,4\"],\"cid\":[\"6\"],\"name\":[\"成龙\"],\"selpid\":[\"root\"],\"url\":[\"\"],\"sortstring\":[\"\"],\"available\":[\"1\"]}','2017-08-14 21:25:54',0),(394,'127.0.0.1',2,'管理员','','common/resource/index/6','{}','2017-08-14 21:25:54',0),(395,'127.0.0.1',2,'管理员','','common/resource/4/6/toAddChild/0,4','{}','2017-08-14 21:25:56',0),(396,'127.0.0.1',2,'管理员','','common/resource/addCategoryChild','{\"tokenKey\":[\"e3e0b3b7-b379-4529-b81c-b71233dbd34d\"],\"tokenValue\":[\"e2af163b-1d09-46eb-9916-d3d85d47c309\"],\"id\":[\"\"],\"parentid\":[\"4\"],\"parentids\":[\"0,4\"],\"cid\":[\"6\"],\"name\":[\"吴京\"],\"selpid\":[\"root\"],\"url\":[\"\"],\"sortstring\":[\"\"],\"available\":[\"1\"]}','2017-08-14 21:26:00',0),(397,'127.0.0.1',2,'管理员','','common/resource/index/6','{}','2017-08-14 21:26:01',0),(398,'127.0.0.1',2,'管理员','','common/resource/4/6/toAddChild/0,4','{}','2017-08-14 21:26:04',0),(399,'127.0.0.1',2,'管理员','','common/resource/index/7','{}','2017-08-14 21:26:15',0),(400,'127.0.0.1',2,'管理员','','common/resource/1/7/toAddChild/0,1','{}','2017-08-14 21:26:17',0),(401,'127.0.0.1',2,'管理员','','common/resource/addCategoryChild','{\"tokenKey\":[\"3d0dd5d3-af34-4139-9569-96b4a1bd5f8b\"],\"tokenValue\":[\"e5e836eb-dedf-4d39-a627-548b50aeb4bd\"],\"id\":[\"\"],\"parentid\":[\"1\"],\"parentids\":[\"0,1\"],\"cid\":[\"7\"],\"name\":[\"php\"],\"selpid\":[\"开发\"],\"url\":[\"\"],\"sortstring\":[\"\"],\"available\":[\"1\"]}','2017-08-14 21:26:34',0),(402,'127.0.0.1',2,'管理员','','common/resource/index/7','{}','2017-08-14 21:26:34',0),(403,'127.0.0.1',2,'管理员','','common/resource/1/7/toAddChild/0,1','{}','2017-08-14 21:26:41',0),(404,'127.0.0.1',2,'管理员','','common/resource/10/7/toUpdateChild/0,1,10','{}','2017-08-14 21:26:50',0),(405,'127.0.0.1',2,'管理员','','common/resource/10/7/toAddChild/0,1,10','{}','2017-08-14 21:26:52',0),(406,'127.0.0.1',2,'管理员','','common/resource/3/7/toAddChild/0,1,3','{}','2017-08-14 21:26:55',0),(407,'127.0.0.1',2,'管理员','','common/resource/1/7/toAddChild/0,1','{}','2017-08-14 21:26:58',0),(408,'127.0.0.1',2,'管理员','','common/resource/index/5','{}','2017-08-14 21:27:14',0),(409,'127.0.0.1',2,'管理员','','common/resource/5/5/toAddChild/0,5','{}','2017-08-14 21:27:16',0),(410,'127.0.0.1',2,'管理员','文件管理','upload/fileManagement','{}','2017-08-14 21:27:35',0),(411,'127.0.0.1',2,'管理员','','file/index/3/7','{}','2017-08-14 21:27:38',0),(412,'127.0.0.1',2,'管理员','秒杀演示','seckill/list','{}','2017-08-14 21:27:48',0),(413,'127.0.0.1',2,'管理员','','seckill/1007/detail','{}','2017-08-14 21:27:51',0),(414,'127.0.0.1',2,'管理员','','seckill/time/now','{}','2017-08-14 21:27:51',0),(415,'127.0.0.1',2,'管理员','','seckill/1006/detail','{}','2017-08-14 21:27:56',0),(416,'127.0.0.1',2,'管理员','','seckill/time/now','{}','2017-08-14 21:27:57',0),(417,'127.0.0.1',2,'管理员','','common/resource/1/7/toUpdateChild/0,1','{}','2017-08-14 21:28:19',0),(418,'127.0.0.1',2,'管理员','','common/resource/10/7/toUpdateChild/0,1,10','{}','2017-08-14 21:28:23',0),(419,'127.0.0.1',2,'管理员','','common/resource/10/7/toAddChild/0,1,10','{}','2017-08-14 21:28:26',0),(420,'127.0.0.1',2,'管理员','','common/resource/2/7/toAddChild/0,2','{}','2017-08-14 21:28:29',0),(421,'127.0.0.1',2,'管理员','','common/resource/1/7/toAddChild/0,1','{}','2017-08-14 21:28:32',0),(422,'127.0.0.1',2,'管理员','','common/resource/1/7/toAddChild/0,1','{}','2017-08-14 21:30:00',0),(423,'127.0.0.1',2,'管理员','','common/resource/4/6/toAddChild/0,4','{}','2017-08-14 21:30:04',0),(424,'127.0.0.1',0,'','','common/main/login','{}','2017-08-14 21:30:11',0),(425,'127.0.0.1',2,'管理员','','common/main/index','{}','2017-08-14 21:30:21',0),(426,'127.0.0.1',2,'管理员','资源管理','common/resource/default','{}','2017-08-14 21:30:24',0),(427,'127.0.0.1',2,'管理员','资源查看','common/resource/index','{}','2017-08-14 21:30:24',0),(428,'127.0.0.1',2,'管理员','','common/resource/index/7','{}','2017-08-14 21:30:28',0),(429,'127.0.0.1',2,'管理员','','common/resource/1/7/toAddChild/0,1','{}','2017-08-14 21:30:30',0),(430,'127.0.0.1',2,'管理员','','common/resource/1/7/toAddChild/0,1','{}','2017-08-14 21:30:39',0),(431,'127.0.0.1',2,'管理员','','common/resource/2/7/toAddChild/0,2','{}','2017-08-14 21:31:18',0),(432,'127.0.0.1',2,'管理员','文件上传','upload/index','{}','2017-08-14 21:32:09',0),(433,'127.0.0.1',2,'管理员','文件管理','upload/fileManagement','{}','2017-08-14 21:32:11',0),(434,'127.0.0.1',2,'管理员','','file/index/3/7','{}','2017-08-14 21:32:13',0),(435,'127.0.0.1',2,'管理员','','common/file/%E4%B8%8B%E8%BD%BD%E6%96%87%E4%BB%B6/chgFlag/upload/2/download','{}','2017-08-14 21:32:20',0),(436,'127.0.0.1',2,'管理员','','common/file/%E4%B8%8B%E8%BD%BD%E6%96%87%E4%BB%B6/chgFlag/upload/2/download','{}','2017-08-14 21:32:22',0),(437,'127.0.0.1',2,'管理员','文件管理','upload/fileManagement','{}','2017-08-14 21:32:43',0),(438,'127.0.0.1',2,'管理员','','file/index/3/7','{}','2017-08-14 21:32:47',0),(439,'127.0.0.1',2,'管理员','文件管理','upload/fileManagement','{}','2017-08-14 21:32:52',0),(440,'127.0.0.1',2,'管理员','文件管理','upload/fileManagement','{}','2017-08-14 21:33:00',0),(441,'127.0.0.1',2,'管理员','','file/index/3/7','{}','2017-08-14 21:33:02',0);

/*Table structure for table `cm_resource` */

DROP TABLE IF EXISTS `cm_resource`;

CREATE TABLE `cm_resource` (
  `id` int(11) NOT NULL AUTO_INCREMENT COMMENT 'PK',
  `pid` int(11) NOT NULL DEFAULT '0' COMMENT 'ParentID',
  `name` varchar(100) NOT NULL DEFAULT '' COMMENT '资源名称，既操作释义',
  `widgetCode` varchar(50) NOT NULL DEFAULT '' COMMENT '界面控件编码，用于控制界面控件的显示，规则：控件类型_操作',
  `url` varchar(100) NOT NULL DEFAULT '' COMMENT '关联访问地址（相对）',
  `seq` tinyint(4) NOT NULL DEFAULT '0',
  `menuFlag` tinyint(4) NOT NULL DEFAULT '0' COMMENT '菜单标识位，0：非菜单，1：菜单',
  `operType` tinyint(4) NOT NULL DEFAULT '0' COMMENT '操作类型，0：查询，1：增删改',
  `chkAuthFlag` tinyint(4) NOT NULL DEFAULT '0' COMMENT '鉴权标志位，0：不鉴权，1：鉴权',
  `addPerson` varchar(20) NOT NULL DEFAULT '' COMMENT '添加人',
  `addTime` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP COMMENT '添加时间',
  `updatePerson` varchar(20) NOT NULL DEFAULT '' COMMENT '修改人',
  `updateTime` timestamp NOT NULL DEFAULT '0000-00-00 00:00:00' COMMENT '修改时间',
  `delFlag` tinyint(4) NOT NULL DEFAULT '0' COMMENT '删除标识位，0：未删除，1：已删除',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COMMENT='系统资源表';

/*Data for the table `cm_resource` */

/*Table structure for table `cm_role` */

DROP TABLE IF EXISTS `cm_role`;

CREATE TABLE `cm_role` (
  `id` int(11) NOT NULL AUTO_INCREMENT COMMENT 'PK',
  `name` varchar(100) NOT NULL DEFAULT '' COMMENT '角色名称',
  `type` tinyint(4) NOT NULL DEFAULT '0' COMMENT '角色类型，1：基础员工（可查看自己名下数据），2：经理（可查看本组织内人员数据），3：管理员（可查看所有数据）',
  `addPerson` varchar(20) NOT NULL DEFAULT '' COMMENT '添加人',
  `addTime` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP COMMENT '添加时间',
  `updatePerson` varchar(20) NOT NULL DEFAULT '' COMMENT '修改人',
  `updateTime` timestamp NOT NULL DEFAULT '0000-00-00 00:00:00' COMMENT '修改时间',
  `delFlag` tinyint(4) NOT NULL DEFAULT '0' COMMENT '删除标识位，0：未删除，1：已删除',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COMMENT='系统角色表';

/*Data for the table `cm_role` */

/*Table structure for table `cm_role_resource_rel` */

DROP TABLE IF EXISTS `cm_role_resource_rel`;

CREATE TABLE `cm_role_resource_rel` (
  `id` int(11) NOT NULL AUTO_INCREMENT COMMENT 'PK',
  `roleId` int(11) NOT NULL DEFAULT '0' COMMENT '角色ID',
  `resourceId` int(11) NOT NULL DEFAULT '0' COMMENT '资源ID',
  `addPerson` varchar(20) NOT NULL DEFAULT '' COMMENT '添加人',
  `addTime` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP COMMENT '添加时间',
  `updatePerson` varchar(20) NOT NULL DEFAULT '' COMMENT '修改人',
  `updateTime` timestamp NOT NULL DEFAULT '0000-00-00 00:00:00' COMMENT '修改时间',
  `delFlag` tinyint(4) NOT NULL DEFAULT '0' COMMENT '删除标识位，0：未删除，1：已删除',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COMMENT='角色-资源关联表';

/*Data for the table `cm_role_resource_rel` */

/*Table structure for table `cm_service_area` */

DROP TABLE IF EXISTS `cm_service_area`;

CREATE TABLE `cm_service_area` (
  `id` int(11) NOT NULL AUTO_INCREMENT COMMENT 'PK',
  `pid` int(11) NOT NULL DEFAULT '0' COMMENT 'ParentID',
  `name` varchar(10) NOT NULL DEFAULT '' COMMENT '名称',
  `pinyin` varchar(100) NOT NULL DEFAULT '' COMMENT '拼音',
  `fpy` varchar(10) NOT NULL DEFAULT '' COMMENT '首字母拼音',
  `level` tinyint(4) NOT NULL DEFAULT '0' COMMENT '级别，1：省（+直辖市），2：地级市和直辖市，3：区县，4：商圈',
  `seq` int(4) NOT NULL DEFAULT '0' COMMENT '顺序',
  `addPerson` varchar(20) NOT NULL DEFAULT '' COMMENT '添加人',
  `addTime` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP COMMENT '添加时间',
  `updatePerson` varchar(20) NOT NULL DEFAULT '' COMMENT '修改人',
  `updateTime` timestamp NOT NULL DEFAULT '0000-00-00 00:00:00' COMMENT '修改时间',
  `delFlag` tinyint(4) NOT NULL DEFAULT '0' COMMENT '删除标识位，0：未删除，1：已删除',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COMMENT='服务区域配置表';

/*Data for the table `cm_service_area` */

/*Table structure for table `cm_take_time` */

DROP TABLE IF EXISTS `cm_take_time`;

CREATE TABLE `cm_take_time` (
  `id` int(11) NOT NULL AUTO_INCREMENT COMMENT 'PK',
  `mcId` int(11) NOT NULL DEFAULT '0' COMMENT '餐别ID(基础数据表)',
  `value` varchar(5) NOT NULL DEFAULT '' COMMENT 'Value（例如：11:50）',
  `seq` int(4) NOT NULL DEFAULT '0' COMMENT '顺序',
  `addPerson` varchar(20) NOT NULL DEFAULT '' COMMENT '添加人',
  `addTime` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP COMMENT '添加时间',
  `updatePerson` varchar(20) NOT NULL DEFAULT '' COMMENT '修改人',
  `updateTime` timestamp NOT NULL DEFAULT '0000-00-00 00:00:00' COMMENT '修改时间',
  `delFlag` tinyint(4) NOT NULL DEFAULT '0' COMMENT '删除标识位，0：未删除，1：已删除',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COMMENT='取餐时间配置表';

/*Data for the table `cm_take_time` */

/*Table structure for table `cm_user` */

DROP TABLE IF EXISTS `cm_user`;

CREATE TABLE `cm_user` (
  `id` int(11) NOT NULL AUTO_INCREMENT COMMENT 'PK',
  `userName` varchar(30) NOT NULL DEFAULT '' COMMENT '用户名',
  `realName` varchar(30) NOT NULL DEFAULT '' COMMENT '真实姓名',
  `password` varchar(100) NOT NULL DEFAULT '' COMMENT '用户密码',
  `roleId` int(11) NOT NULL DEFAULT '0' COMMENT '角色ID',
  `addTime` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP COMMENT '添加时间',
  `updateTime` timestamp NOT NULL DEFAULT '0000-00-00 00:00:00' COMMENT '修改时间',
  `delFlag` tinyint(4) NOT NULL DEFAULT '0' COMMENT '删除标识位，0：未删除，1：已删除',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COMMENT='人员表';

/*Data for the table `cm_user` */

/*Table structure for table `file_category` */

DROP TABLE IF EXISTS `file_category`;

CREATE TABLE `file_category` (
  `id` bigint(20) NOT NULL AUTO_INCREMENT COMMENT '主键',
  `typeId` int(11) NOT NULL DEFAULT '0' COMMENT '目录ID - 外键',
  `name` varchar(128) NOT NULL COMMENT '目录名称',
  `icon` varchar(128) DEFAULT NULL COMMENT '图标',
  `url` varchar(128) DEFAULT NULL COMMENT '访问url地址',
  `parentid` bigint(20) DEFAULT NULL COMMENT '父结点id',
  `parentids` varchar(128) DEFAULT NULL COMMENT '父结点id列表串',
  `sortstring` varchar(128) DEFAULT NULL COMMENT '排序号',
  `available` char(1) DEFAULT NULL COMMENT '是否可用,1：可用，0不可用',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=11 DEFAULT CHARSET=utf8;

/*Data for the table `file_category` */

insert  into `file_category`(`id`,`typeId`,`name`,`icon`,`url`,`parentid`,`parentids`,`sortstring`,`available`) values (1,7,'开发',NULL,NULL,0,'0',NULL,'1'),(2,7,'网络',NULL,NULL,0,'0',NULL,'1'),(3,7,'java',NULL,'file/index/3/7',1,'0/1',NULL,'1'),(4,6,'动作',NULL,NULL,0,'0',NULL,'1'),(5,5,'流行',NULL,NULL,0,'0',NULL,'1'),(6,6,'喜剧片',NULL,NULL,0,'0',NULL,'1'),(7,6,'李连杰',NULL,NULL,4,'0/4',NULL,'1'),(8,6,'成龙',NULL,NULL,4,'0/4',NULL,'1'),(9,6,'吴京',NULL,NULL,4,'0/4',NULL,'1'),(10,7,'php',NULL,NULL,1,'0/1',NULL,'1');

/*Table structure for table `file_upload` */

DROP TABLE IF EXISTS `file_upload`;

CREATE TABLE `file_upload` (
  `id` bigint(20) NOT NULL AUTO_INCREMENT COMMENT 'PK',
  `categoryId` int(11) NOT NULL DEFAULT '0' COMMENT '分类目录 - 外键',
  `typeId` int(11) NOT NULL DEFAULT '0' COMMENT '类别目录 - 外键',
  `file_name` varchar(255) NOT NULL DEFAULT '' COMMENT '文件名',
  `file_type` varchar(120) NOT NULL DEFAULT '' COMMENT '文件类型',
  `file_size` bigint(20) NOT NULL DEFAULT '0' COMMENT '文件大小(字节)',
  `url` varchar(255) NOT NULL DEFAULT '' COMMENT '上传地址',
  `upload_time` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP COMMENT '上传时间',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=3 DEFAULT CHARSET=utf8 COMMENT='文件上传表';

/*Data for the table `file_upload` */

insert  into `file_upload`(`id`,`categoryId`,`typeId`,`file_name`,`file_type`,`file_size`,`url`,`upload_time`) values (1,7,3,'Water lilies.jpg','image/jpeg',83794,'d:\\upload\\软件\\开发\\java\\1502714821437-Water lilies.jpg','2017-08-14 20:47:01'),(2,7,3,'师生恋.flv','application/octet-stream',55280407,'d:\\upload\\软件\\开发\\java\\1502714874890-师生恋.flv','2017-08-14 20:47:54');

/*Table structure for table `prd_cleandishes` */

DROP TABLE IF EXISTS `prd_cleandishes`;

CREATE TABLE `prd_cleandishes` (
  `id` int(11) NOT NULL AUTO_INCREMENT COMMENT 'PK',
  `name` varchar(20) NOT NULL DEFAULT '' COMMENT '名称',
  `pinyin` varchar(200) NOT NULL DEFAULT '' COMMENT '拼音',
  `fpy` varchar(20) NOT NULL DEFAULT '' COMMENT '首字母拼音',
  `maId` int(11) NOT NULL DEFAULT '0' COMMENT '食材（物料）ID',
  `ratio` decimal(10,4) NOT NULL DEFAULT '0.0000' COMMENT '与食材转化比例，净菜为1',
  `nodeUseTime` int(8) NOT NULL DEFAULT '0' COMMENT '单节点制作用时（分/kg）',
  `note` varchar(500) NOT NULL DEFAULT '' COMMENT '备注',
  `addPerson` varchar(20) NOT NULL DEFAULT '' COMMENT '添加人',
  `addTime` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP COMMENT '添加时间',
  `updatePerson` varchar(20) NOT NULL DEFAULT '' COMMENT '修改人',
  `updateTime` timestamp NOT NULL DEFAULT '0000-00-00 00:00:00' COMMENT '修改时间',
  `delFlag` tinyint(4) NOT NULL DEFAULT '0' COMMENT '删除标识位，0：未删除，1：已删除',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COMMENT='净菜表';

/*Data for the table `prd_cleandishes` */

/*Table structure for table `prd_cleandishes_rel` */

DROP TABLE IF EXISTS `prd_cleandishes_rel`;

CREATE TABLE `prd_cleandishes_rel` (
  `id` int(11) NOT NULL AUTO_INCREMENT COMMENT 'PK',
  `prdId` int(11) NOT NULL DEFAULT '0' COMMENT '菜品ID',
  `cdId` int(11) NOT NULL DEFAULT '0' COMMENT '净菜ID',
  `num` int(11) NOT NULL DEFAULT '0' COMMENT '数量，菜品为1份',
  `uomId` int(11) NOT NULL DEFAULT '0' COMMENT '计量单位ID(基础数据表)',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COMMENT='菜品-净菜关联表';

/*Data for the table `prd_cleandishes_rel` */

/*Table structure for table `prd_material` */

DROP TABLE IF EXISTS `prd_material`;

CREATE TABLE `prd_material` (
  `id` int(11) NOT NULL AUTO_INCREMENT COMMENT 'PK',
  `typeId` int(11) NOT NULL DEFAULT '0' COMMENT '物料类型ID',
  `name` varchar(20) NOT NULL DEFAULT '' COMMENT '物料名称',
  `pinyin` varchar(200) NOT NULL DEFAULT '' COMMENT '拼音',
  `fpy` varchar(20) NOT NULL DEFAULT '' COMMENT '首字母拼音',
  `uomId` int(11) NOT NULL DEFAULT '0' COMMENT '计量单位ID(基础数据表)',
  `purchaseType` tinyint(4) NOT NULL DEFAULT '0' COMMENT '采购类型，0：非日常采购，1：日常采购',
  `addPerson` varchar(20) NOT NULL DEFAULT '' COMMENT '添加人',
  `addTime` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP COMMENT '添加时间',
  `updatePerson` varchar(20) NOT NULL DEFAULT '' COMMENT '修改人',
  `updateTime` timestamp NOT NULL DEFAULT '0000-00-00 00:00:00' COMMENT '修改时间',
  `delFlag` tinyint(4) NOT NULL DEFAULT '0' COMMENT '删除标识位，0：未删除，1：已删除',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COMMENT='物料表';

/*Data for the table `prd_material` */

/*Table structure for table `prd_material_rel` */

DROP TABLE IF EXISTS `prd_material_rel`;

CREATE TABLE `prd_material_rel` (
  `id` int(11) NOT NULL AUTO_INCREMENT COMMENT 'PK',
  `prdId` int(11) NOT NULL DEFAULT '0' COMMENT '菜品ID',
  `maId` int(11) NOT NULL DEFAULT '0' COMMENT '物料ID',
  `num` int(11) NOT NULL DEFAULT '0' COMMENT '数量，菜品为1份',
  `uomId` int(11) NOT NULL DEFAULT '0' COMMENT '计量单位ID(基础数据表)',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COMMENT='菜品-物料关联表';

/*Data for the table `prd_material_rel` */

/*Table structure for table `prd_material_type` */

DROP TABLE IF EXISTS `prd_material_type`;

CREATE TABLE `prd_material_type` (
  `id` int(11) NOT NULL AUTO_INCREMENT COMMENT 'PK',
  `pid` int(11) NOT NULL DEFAULT '0' COMMENT 'ParentID',
  `name` varchar(10) NOT NULL DEFAULT '' COMMENT '名称',
  `pinyin` varchar(100) NOT NULL DEFAULT '' COMMENT '拼音',
  `fpy` varchar(10) NOT NULL DEFAULT '' COMMENT '首字母拼音',
  `level` tinyint(4) NOT NULL DEFAULT '0' COMMENT '级别',
  `seq` int(4) NOT NULL DEFAULT '0' COMMENT '顺序',
  `addPerson` varchar(20) NOT NULL DEFAULT '' COMMENT '添加人',
  `addTime` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP COMMENT '添加时间',
  `updatePerson` varchar(20) NOT NULL DEFAULT '' COMMENT '修改人',
  `updateTime` timestamp NOT NULL DEFAULT '0000-00-00 00:00:00' COMMENT '修改时间',
  `delFlag` tinyint(4) NOT NULL DEFAULT '0' COMMENT '删除标识位，0：未删除，1：已删除',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COMMENT='物料类型配置表';

/*Data for the table `prd_material_type` */

/*Table structure for table `prd_pd_cd` */

DROP TABLE IF EXISTS `prd_pd_cd`;

CREATE TABLE `prd_pd_cd` (
  `id` int(11) NOT NULL AUTO_INCREMENT COMMENT 'PK',
  `pdId` int(11) NOT NULL DEFAULT '0' COMMENT '备菜ID',
  `cdId` int(11) NOT NULL DEFAULT '0' COMMENT '净菜ID',
  `ratio` decimal(10,4) NOT NULL DEFAULT '0.0000' COMMENT '比例关系，备菜为1000g',
  `uomId` int(11) NOT NULL DEFAULT '0' COMMENT '计量单位ID(基础数据表)',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COMMENT='备菜-净菜关联表';

/*Data for the table `prd_pd_cd` */

/*Table structure for table `prd_pd_ma` */

DROP TABLE IF EXISTS `prd_pd_ma`;

CREATE TABLE `prd_pd_ma` (
  `id` int(11) NOT NULL AUTO_INCREMENT COMMENT 'PK',
  `prdId` int(11) NOT NULL DEFAULT '0' COMMENT '菜品ID',
  `maId` int(11) NOT NULL DEFAULT '0' COMMENT '物料ID',
  `ratio` decimal(10,4) NOT NULL DEFAULT '0.0000' COMMENT '比例关系，备菜为1000g',
  `uomId` int(11) NOT NULL DEFAULT '0' COMMENT '计量单位ID(基础数据表)',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COMMENT='备菜-物料关联表';

/*Data for the table `prd_pd_ma` */

/*Table structure for table `prd_preparedishes` */

DROP TABLE IF EXISTS `prd_preparedishes`;

CREATE TABLE `prd_preparedishes` (
  `id` int(11) NOT NULL AUTO_INCREMENT COMMENT 'PK',
  `name` varchar(20) NOT NULL DEFAULT '' COMMENT '名称',
  `pinyin` varchar(200) NOT NULL DEFAULT '' COMMENT '拼音',
  `fpy` varchar(20) NOT NULL DEFAULT '' COMMENT '首字母拼音',
  `nodeUseTime` int(8) NOT NULL DEFAULT '0' COMMENT '单节点制作用时（分，主要指腌制、泡发等时间）',
  `addPerson` varchar(20) NOT NULL DEFAULT '' COMMENT '添加人',
  `addTime` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP COMMENT '添加时间',
  `updatePerson` varchar(20) NOT NULL DEFAULT '' COMMENT '修改人',
  `updateTime` timestamp NOT NULL DEFAULT '0000-00-00 00:00:00' COMMENT '修改时间',
  `delFlag` tinyint(4) NOT NULL DEFAULT '0' COMMENT '删除标识位，0：未删除，1：已删除',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COMMENT='备菜表';

/*Data for the table `prd_preparedishes` */

/*Table structure for table `prd_preparedishes_rel` */

DROP TABLE IF EXISTS `prd_preparedishes_rel`;

CREATE TABLE `prd_preparedishes_rel` (
  `id` int(11) NOT NULL AUTO_INCREMENT COMMENT 'PK',
  `prdId` int(11) NOT NULL DEFAULT '0' COMMENT '菜品ID',
  `pdId` int(11) NOT NULL DEFAULT '0' COMMENT '备菜ID',
  `num` int(11) NOT NULL DEFAULT '0' COMMENT '数量，菜品为1份',
  `uomId` int(11) NOT NULL DEFAULT '0' COMMENT '计量单位ID(基础数据表)',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COMMENT='菜品-备菜关联表';

/*Data for the table `prd_preparedishes_rel` */

/*Table structure for table `prd_product` */

DROP TABLE IF EXISTS `prd_product`;

CREATE TABLE `prd_product` (
  `id` int(11) NOT NULL AUTO_INCREMENT COMMENT 'PK',
  `name` varchar(20) NOT NULL DEFAULT '' COMMENT '产品名称',
  `description` text NOT NULL COMMENT '产品描述',
  `typeId` int(11) NOT NULL DEFAULT '0' COMMENT '类型ID(基础数据表)',
  `nodeUseTime` int(8) NOT NULL DEFAULT '0' COMMENT '单节点制作用时（分）',
  `maxMakeNum` int(8) NOT NULL DEFAULT '0' COMMENT '单次最多制作份数',
  `addPerson` varchar(20) NOT NULL DEFAULT '' COMMENT '添加人',
  `addTime` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP COMMENT '添加时间',
  `updatePerson` varchar(20) NOT NULL DEFAULT '' COMMENT '修改人',
  `updateTime` timestamp NOT NULL DEFAULT '0000-00-00 00:00:00' COMMENT '修改时间',
  `delFlag` tinyint(4) NOT NULL DEFAULT '0' COMMENT '删除标识位，0：未删除，1：已删除',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COMMENT='产品表';

/*Data for the table `prd_product` */

/*Table structure for table `seckill` */

DROP TABLE IF EXISTS `seckill`;

CREATE TABLE `seckill` (
  `seckill_id` bigint(20) NOT NULL AUTO_INCREMENT COMMENT '商品库存id',
  `name` varchar(120) NOT NULL COMMENT '商品名称',
  `number` int(11) NOT NULL COMMENT '商品库存',
  `start_time` timestamp NOT NULL DEFAULT '0000-00-00 00:00:00' COMMENT '秒杀开始的时间',
  `end_time` timestamp NOT NULL DEFAULT '0000-00-00 00:00:00' COMMENT '秒杀结束的时间',
  `create_time` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP COMMENT '秒杀创建的时间',
  PRIMARY KEY (`seckill_id`),
  KEY `idx_start_time` (`start_time`),
  KEY `idx_end_time` (`end_time`),
  KEY `idx_create_time` (`create_time`)
) ENGINE=InnoDB AUTO_INCREMENT=1008 DEFAULT CHARSET=utf8 COMMENT='秒杀库存表';

/*Data for the table `seckill` */

insert  into `seckill`(`seckill_id`,`name`,`number`,`start_time`,`end_time`,`create_time`) values (1004,'1000元秒杀iphone6',100,'2015-11-01 00:00:00','2015-11-02 00:00:00','2017-08-14 17:45:24'),(1005,'500元秒杀小米6',50,'2015-11-01 00:00:00','2015-11-02 00:00:00','2017-08-14 17:45:24'),(1006,'600元秒杀ipad',120,'2015-11-01 00:00:00','2015-11-02 00:00:00','2017-08-14 17:45:24'),(1007,'550元秒杀小米6',50,'2015-11-01 00:00:00','2015-11-02 00:00:00','2017-08-14 17:45:24');

/*Table structure for table `success_killed` */

DROP TABLE IF EXISTS `success_killed`;

CREATE TABLE `success_killed` (
  `seckill_id` bigint(20) NOT NULL COMMENT '秒杀商品的id',
  `user_phone` bigint(20) NOT NULL COMMENT '用户手机号',
  `state` tinyint(4) NOT NULL DEFAULT '0' COMMENT '状态表示：-1表示无效,0表示成功,1,已经付款',
  `create_time` timestamp NOT NULL DEFAULT '0000-00-00 00:00:00' COMMENT '创建时间',
  PRIMARY KEY (`seckill_id`,`user_phone`),
  KEY `idx_create_time` (`create_time`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COMMENT='秒杀成功明细表';

/*Data for the table `success_killed` */

/*Table structure for table `sys_permission` */

DROP TABLE IF EXISTS `sys_permission`;

CREATE TABLE `sys_permission` (
  `id` bigint(20) NOT NULL AUTO_INCREMENT COMMENT '主键',
  `name` varchar(128) NOT NULL COMMENT '资源名称',
  `type` varchar(32) NOT NULL COMMENT '资源类型：menu,button,',
  `url` varchar(128) DEFAULT NULL COMMENT '访问url地址',
  `percode` varchar(128) DEFAULT NULL COMMENT '权限代码字符串',
  `parentid` bigint(20) DEFAULT NULL COMMENT '父结点id',
  `parentids` varchar(128) DEFAULT NULL COMMENT '父结点id列表串',
  `sortstring` varchar(128) DEFAULT NULL COMMENT '排序号',
  `available` char(1) DEFAULT NULL COMMENT '是否可用,1：可用，0不可用',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=71 DEFAULT CHARSET=utf8;

/*Data for the table `sys_permission` */

insert  into `sys_permission`(`id`,`name`,`type`,`url`,`percode`,`parentid`,`parentids`,`sortstring`,`available`) values (1,'系统管理','menu','','',0,'0','0','1'),(11,'资源管理','menu','common/resource/default','res:view',1,'0/1','11','1'),(12,'资源新增','perm','common/resource/addChild','res:add',11,'0/1/11','2','1'),(13,'资源修改','perm','common/resource/updateChild','res:update',11,'0/1/11','','1'),(14,'资源删除','perm','common/resource/delete','res:delete',11,'0/1/11','','1'),(21,'角色管理','menu','common/role/index','role:view',1,'0/1','12','1'),(22,'角色新增','perm','common/role/add','role:add',21,'0/1/21','','1'),(23,'角色修改','perm','','role:update',21,'0/1/21','','1'),(24,'角色删除','perm','','role:delete',21,'0/1/21','','1'),(26,'角色授权','perm','','role:auth',21,'0/1/21','','1'),(27,'资源查看','perm','common/resource/index','res:view',11,'0/1/11','','1'),(28,'角色查看','perm','','role:view',21,'0/1/21','','1'),(29,'用户管理','menu','common/user/index','user:view',1,'0/1','13','1'),(30,'用户新增','perm','','user:add',29,'0/1/29','','1'),(31,'用户修改','perm','','user:update',29,'0/1/29','','1'),(32,'用户删除','perm','','user:delete',29,'0/1/29','','1'),(33,'用户查看','perm','','user:view',29,'0/1/29','','1'),(34,'用户详情','perm','','user:detail',29,'0/1/29','','1'),(35,'用户锁定','perm','','user:lock',29,'0/1/29','','1'),(36,'设置密码','perm','','user:setPWD',29,'0/1/29','','1'),(37,'重置密码','perm','','user:resetPWD',29,'0/1/29','','1'),(39,'产品管理','menu','','',0,'0','1','1'),(41,'物料管理','menu','','',39,'0/39','2','1'),(42,'净菜管理','menu','','',39,'0/39','3','1'),(43,'备菜管理','menu','','',39,'0/39','4','1'),(44,'产品管理','menu','','',39,'0/39','5','1'),(45,'物料类型管理','menu','','',39,'0/39','1','1'),(46,'日志管理','menu','',NULL,1,'0/1','19','1'),(47,'日志查询','menu','common/main/operLogList','log:view',46,'0/1/46',NULL,'1'),(48,'基础数据','menu','common/baseData/index','baseData:view',1,'0/1','14','1'),(49,'基础数据新增','perm','baseData:add','baseData:add',48,'0/1/48','1','1'),(50,'基础数据修改','perm',NULL,'baseData:update',48,'0/1/48','2','1'),(51,'基础数据启禁用','perm',NULL,'baseData:chgFlag',48,'0/1/48','3','1'),(52,'基础数据删除','perm',NULL,'baseData:delete',48,'0/1/48','4','1'),(53,'基础数据查看','perm',NULL,'baseData:view',48,'0/1/48','5','1'),(54,'日志监控','menu','common/main/startLog','realLog:view',46,'0/1/46',NULL,'1'),(55,'历史日志查看','perm',NULL,'log:view',47,'0/1/46/47',NULL,'1'),(56,'实时日志查看','perm',NULL,'realLog:view',54,'0/1/46/54','5','1'),(57,'打印业务开关','perm',NULL,'realLog:print',54,'0/1/46/54','1','1'),(58,'实时监控开关','perm',NULL,'realLog:enable',54,'0/1/46/54','2','1'),(59,'清空日志','perm',NULL,'realLog:clear',54,'0/1/46/54','7','1'),(60,'业务办理','menu',NULL,NULL,0,'0','2','1'),(61,'流程管理','menu','proc/index',NULL,0,'0','3','1'),(62,'请假申请','menu',NULL,NULL,60,'0/60','1','1'),(63,'出差申请','menu',NULL,NULL,60,'0/60','2','1'),(64,'我的业务','menu','leaveBill/index/64',NULL,60,'0/60','0','1'),(65,'流程查看','perm',NULL,NULL,61,'0/61','1','1'),(66,'流程定义','perm',NULL,NULL,61,'0/61','2','1'),(67,'api接口示例','menu','interface/index',NULL,0,'0','4','1'),(68,'文件管理','menu','upload/fileManagement',NULL,0,'0','5','1'),(69,'文件上传','menu','upload/index',NULL,68,'0/68',NULL,'1'),(70,'秒杀演示','menu','seckill/list',NULL,0,'0','7','1');

/*Table structure for table `sys_role` */

DROP TABLE IF EXISTS `sys_role`;

CREATE TABLE `sys_role` (
  `id` int(36) NOT NULL AUTO_INCREMENT,
  `name` varchar(128) NOT NULL DEFAULT '',
  `type` tinyint(4) NOT NULL DEFAULT '0' COMMENT '''角色类型，1：基础员工（可查看自己名下数据），2：经理（可查看本组织内人员数据），3：管理员（可查看所有数据）''',
  `available` char(1) DEFAULT '' COMMENT '是否可用,1：可用，0不可用',
  `addPerson` varchar(20) NOT NULL DEFAULT '',
  `addTime` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP,
  `updatePerson` varchar(2) NOT NULL DEFAULT '',
  `updateTime` timestamp NOT NULL DEFAULT '0000-00-00 00:00:00',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=19 DEFAULT CHARSET=utf8;

/*Data for the table `sys_role` */

insert  into `sys_role`(`id`,`name`,`type`,`available`,`addPerson`,`addTime`,`updatePerson`,`updateTime`) values (1,'管理员',3,'1','','2016-11-02 18:56:55','','2016-11-02 19:20:28'),(2,'用户管理员',1,'1','','2016-11-02 18:56:55','','2016-11-02 19:20:39'),(18,'项目经理',2,'1','','2016-11-03 18:28:33','','0000-00-00 00:00:00');

/*Table structure for table `sys_role_permission` */

DROP TABLE IF EXISTS `sys_role_permission`;

CREATE TABLE `sys_role_permission` (
  `id` int(36) NOT NULL AUTO_INCREMENT,
  `sys_role_id` varchar(32) NOT NULL COMMENT '角色id',
  `sys_permission_id` varchar(32) NOT NULL COMMENT '权限id',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=1050 DEFAULT CHARSET=utf8;

/*Data for the table `sys_role_permission` */

insert  into `sys_role_permission`(`id`,`sys_role_id`,`sys_permission_id`) values (207,'7','11'),(208,'7','12'),(209,'7','13'),(210,'7','27'),(211,'7','21'),(212,'7','22'),(213,'7','23'),(214,'7','28'),(674,'17','1'),(675,'17','11'),(676,'17','13'),(677,'17','14'),(678,'17','27'),(679,'17','21'),(680,'17','22'),(681,'17','23'),(682,'17','26'),(683,'17','28'),(684,'17','29'),(685,'17','30'),(686,'17','32'),(687,'17','33'),(688,'17','34'),(689,'17','36'),(690,'17','37'),(691,'17','48'),(692,'17','51'),(693,'17','53'),(694,'17','46'),(695,'17','47'),(696,'17','39'),(697,'17','43'),(833,'18','1'),(834,'18','11'),(835,'18','27'),(836,'18','29'),(837,'18','30'),(838,'18','46'),(839,'18','54'),(840,'18','59'),(841,'2','1'),(842,'2','21'),(843,'2','28'),(844,'2','48'),(845,'2','53'),(846,'2','46'),(847,'2','54'),(848,'2','58'),(849,'2','56'),(998,'1','1'),(999,'1','11'),(1000,'1','13'),(1001,'1','14'),(1002,'1','27'),(1003,'1','12'),(1004,'1','21'),(1005,'1','22'),(1006,'1','23'),(1007,'1','24'),(1008,'1','26'),(1009,'1','28'),(1010,'1','29'),(1011,'1','30'),(1012,'1','31'),(1013,'1','32'),(1014,'1','33'),(1015,'1','34'),(1016,'1','35'),(1017,'1','36'),(1018,'1','37'),(1019,'1','48'),(1020,'1','49'),(1021,'1','50'),(1022,'1','51'),(1023,'1','52'),(1024,'1','53'),(1025,'1','46'),(1026,'1','47'),(1027,'1','55'),(1028,'1','54'),(1029,'1','57'),(1030,'1','58'),(1031,'1','56'),(1032,'1','59'),(1033,'1','39'),(1034,'1','45'),(1035,'1','41'),(1036,'1','42'),(1037,'1','43'),(1038,'1','44'),(1039,'1','60'),(1040,'1','64'),(1041,'1','62'),(1042,'1','63'),(1043,'1','61'),(1044,'1','65'),(1045,'1','66'),(1046,'1','67'),(1047,'1','68'),(1048,'1','69'),(1049,'1','70');

/*Table structure for table `sys_user` */

DROP TABLE IF EXISTS `sys_user`;

CREATE TABLE `sys_user` (
  `id` int(36) NOT NULL AUTO_INCREMENT COMMENT '主键',
  `usercode` varchar(32) NOT NULL COMMENT '账号',
  `username` varchar(64) NOT NULL COMMENT '姓名',
  `password` varchar(32) NOT NULL COMMENT '密码',
  `salt` varchar(64) DEFAULT NULL COMMENT '盐',
  `locked` char(1) DEFAULT NULL COMMENT '账号是否锁定，1：锁定，0未锁定',
  `pids` varchar(512) NOT NULL DEFAULT '' COMMENT '审批领导‘,’分隔',
  `updateTime` timestamp NOT NULL DEFAULT '0000-00-00 00:00:00',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=18 DEFAULT CHARSET=utf8;

/*Data for the table `sys_user` */

insert  into `sys_user`(`id`,`usercode`,`username`,`password`,`salt`,`locked`,`pids`,`updateTime`) values (1,'test','测试账号','a954a76b34901a8be5839775cea7167a','uiwueylm','0','','2016-11-18 14:05:32'),(2,'admin','管理员','48e1a118a99e59fb09254e42a0335bc8','eteokues','0','','2016-11-14 18:26:06'),(11,'user','用户','fe81a5dc1dd37853c96cd031e998f994','037634197b3cf4919be3c089299f9478874fc47806924977','0','','2016-11-09 12:08:02'),(12,'guest','访客','40acf070f6147f832fdf0111109934a7','71522af8ff0596244bf22b1e632e3da1c080263554b29780','0','','2016-11-29 17:58:06'),(13,'anon','匿名用户','8140fedfbecd48856fa60c6904183665','56fc8086f872a64562220646e4cc4be2024651b56fd49514','0','','2016-11-29 17:58:07'),(14,'manager','经理人','2faff3993d87f4266e00350ae2fea1ae','265e7f51b442918963699d0ad4d256b6fc58e67c7c03a454','1','','2016-11-29 18:01:37'),(15,'123','123','5047cf548e8ceb6bf369022fc376ca82','964806052d0d97633e399695b8e62843984ab3f960760d97','0','1,11','2016-11-29 17:43:49'),(16,'sdfsd','sdfsdf','07376fb4a5fc5cacba0207893ab613a2','e1ea93b2cf0f24f319c79c2881113254ca6920e504758415','0','1,2,14,15','2016-11-29 17:57:53'),(17,'dg','sdf','d0c32efeef2b8d0f520ae88836ce7800','b5d54f046d70d2439750717087ea90321e2a807f93d7b505','0','1,11,13','2016-11-29 18:06:07');

/*Table structure for table `sys_user_role` */

DROP TABLE IF EXISTS `sys_user_role`;

CREATE TABLE `sys_user_role` (
  `id` int(36) NOT NULL AUTO_INCREMENT,
  `sys_user_id` varchar(32) NOT NULL,
  `sys_role_id` varchar(32) NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=282 DEFAULT CHARSET=utf8;

/*Data for the table `sys_user_role` */

insert  into `sys_user_role`(`id`,`sys_user_id`,`sys_role_id`) values (211,'2','1'),(231,'1','17'),(232,'1','18'),(233,'11','18'),(258,'11','18'),(264,'2','1'),(267,'1','2'),(268,'1','18'),(273,'15','2'),(274,'16','1'),(275,'16','2'),(276,'16','18'),(277,'12','2'),(278,'13','2'),(280,'14','18'),(281,'17','18');

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;
